emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Morph.c
/*
 * Copyright (c)      2016 eSOL TRINITY, www.esol-trinity.co.jp
 * Copyright (c) 2005-2021 Imperas Software Ltd., www.imperas.com
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
 * either express or implied.
 *
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

// VMI header files
#include "vmi/vmiMt.h"
#include "vmi/vmiRt.h"

// model header files
#include "rl78Decode.h"
#include "rl78Functions.h"
#include "rl78Structure.h"
#include "rl78Utils.h"            // rl78SetPSW_BIT
#include "rl78Message.h"        // MY_ASSERT
#include "rl78Parameters.h"        // enum en_variant



#define UNUSED   __attribute__((unused))

#define    PRE()    \
    UNUSED Uns32    cur = rl78->len_instPrefix + rl78->len_instMnem;    \
    UNUSED Uns32    op1 = 0;    /* operand in instruction bytes */        \
    UNUSED Uns32    op2 = 0;    /* operand in instruction bytes */        \
    UNUSED Uns32    ix1 = 0;    /* bit number of processing */            \
    UNUSED Uns32    dis = 0;    /* displacement */                        \
    UNUSED vmiReg    rg1;        /* register object for processing */    \
    UNUSED vmiReg    rg2;        /* register object for processing */    \
    UNUSED vmiReg    tmp = RL78_TMP;                                        \
    rl78->flagUpdate = en_flag____;                                \
    rl78->bol_setTo4bit = 0;                                    \
    vmiLabelP lbl_skip = vmimtNewLabel();                        \
    doSkip(rl78, lbl_skip)                                        \

#define PST()                                                    \
    MY_ASSERT((cur == rl78->len_instByte), "PST");                \
    vmimtInsertLabel(lbl_skip);


#define IMM1(opx)        /* 1 means 1 byte fetch */                \
    MY_ASSERT((cur < rl78->len_instByte), "IMM1");                \
    opx = instr[cur];                                            \
    cur += 1;

#define IMM2(opx)        /* 2 means 2 bytes fetch */                \
    MY_ASSERT(((cur + 1) < rl78->len_instByte), "IMM2");        \
    opx = instr[cur] + (instr[cur + 1] << 8);                    \
    cur += 2;

#define IMM3(opx)        /* 3 means 3 bytes fetch */                \
    MY_ASSERT(((cur + 2) < rl78->len_instByte), "IMM3");        \
    opx = instr[cur] + (instr[cur + 1] << 8) + (instr[cur + 2] << 16);    \
    cur += 3;

#define GETBIT(lsb, len)    ( (instr[cur - 1] >> lsb) & ((1 << len) - 1) )

#define IDX3(idx)        /* 3 means decode 3 bits */            \
    idx = GETBIT(4, 3);

#define IDX4(idx)        /* 4 means decode 4 bits */            \
    idx = GETBIT(4, 4);

#define BIT3(opx)        /* 3 means decode 3 bits */            \
    opx = GETBIT(0, 3);

#define BIT2(opx)        /* 2 means decode 2 bits */            \
    opx = GETBIT(1, 2);

#define BIT(opx, lsb, len)                                        \
    opx = GETBIT(lsb, len);

#define FLG(flg)    \
    rl78->flagUpdate = en_flag_##flg;


static vmiReg reg_read_8(rl78P rl78, Uns32 ireg) {
    vmiReg reg_D = VMI_NOREG;

    if (ireg < 100) {
        reg_D = RL78_REG(8 * rl78->PSW_RBS + ireg);
    } else {
        switch (ireg) {
            case R_ES : reg_D = RL78_ES   ; break;
            case R_CS : reg_D = RL78_CS   ; break;
            case R_PSW: reg_D = RL78_PSW  ; break;
            case R_CY : reg_D = RL78_CARRY; break;
            default: MY_ASSERT(0, "reg_read_8");
        }
    }
    return reg_D;
}

static vmiReg reg_read_16(rl78P rl78, Uns32 ireg) {

    vmiReg reg_D = VMI_NOREG;

    switch (ireg) {
        case R_AX: reg_D = RL78_REG(8 * rl78->PSW_RBS + R_X); break;
        case R_BC: reg_D = RL78_REG(8 * rl78->PSW_RBS + R_C); break;
        case R_DE: reg_D = RL78_REG(8 * rl78->PSW_RBS + R_E); break;
        case R_HL: reg_D = RL78_REG(8 * rl78->PSW_RBS + R_L); break;
        case R_SP: reg_D = RL78_SP; break;
        default: MY_ASSERT(0, "reg_read_16");
    }

    return reg_D;
}

static void reg_write_16(rl78P rl78, Uns32 ireg) {

    // stack pointer is 2-byte aligned
    if(ireg==R_SP) {
        vmimtBinopRC(16, vmi_AND, RL78_SP, 0xfffe, 0);
    }
}

static vmiReg reg_read_32(rl78P rl78, Uns32 ireg) {

    vmiReg reg_D = VMI_NOREG;

    switch (ireg) {
        case R_BCAX: reg_D = RL78_REG(8 * rl78->PSW_RBS + R_X); break;
        case R_HLDE: reg_D = RL78_REG(8 * rl78->PSW_RBS + R_E); break;
        default: MY_ASSERT(0, "reg_read_32");
    }

    return reg_D;
}

static vmiReg reg_read_x8(rl78P rl78, Uns32 ireg) {

    vmiReg reg_D = RL78_THL;

    vmimtMoveExtendRR(16, RL78_THL, 8, reg_read_8(rl78, ireg), False);

    return reg_D;
}

static void prepareTHL(rl78P rl78, Uns32 ra, vmiReg rb) {

    vmimtMoveExtendRR(16, RL78_THL, 8, rb, False);
    vmimtBinopRR(16, vmi_ADD, RL78_THL, reg_read_16(rl78, ra), 0);
}



const vmiFlags flag_A_ = {        // When decision of PSW.AC, only input is applied, output will be ignored.
    RL78_CARRY_CONST,           // offset to carry in flag
    {
        [vmi_CF] = VMI_NOFLAG_CONST,       // offset to carry out flag
        [vmi_PF] = VMI_NOFLAG_CONST,       // parity flag not used
        [vmi_ZF] = VMI_NOFLAG_CONST,       // zero flag not used
        [vmi_SF] = VMI_NOFLAG_CONST,       // sign flag not used
        [vmi_OF] = VMI_NOFLAG_CONST        // offset to overflow flag
    }
};
const vmiFlags flagZ_C = {
    RL78_CARRY_CONST,           // offset to carry in flag
    {
        [vmi_CF] = RL78_CARRY_CONST,       // offset to carry out flag
        [vmi_PF] = VMI_NOFLAG_CONST,       // parity flag not used
        [vmi_ZF] = RL78_ZERO_CONST ,       // zero flag not used
        [vmi_SF] = VMI_NOFLAG_CONST,       // sign flag not used
        [vmi_OF] = VMI_NOFLAG_CONST        // offset to overflow flag
    }
};
const vmiFlags flagZ__ = {
    RL78_CARRY_CONST,           // offset to carry in flag
    {
        [vmi_CF] = VMI_NOFLAG_CONST,       // offset to carry out flag
        [vmi_PF] = VMI_NOFLAG_CONST,       // parity flag not used
        [vmi_ZF] = RL78_ZERO_CONST ,       // zero flag not used
        [vmi_SF] = VMI_NOFLAG_CONST,       // sign flag not used
        [vmi_OF] = VMI_NOFLAG_CONST        // offset to overflow flag
    }
};
const vmiFlags flag__C = {
    RL78_CARRY_CONST,           // offset to carry in flag
    {
        [vmi_CF] = RL78_CARRY_CONST,       // offset to carry out flag
        [vmi_PF] = VMI_NOFLAG_CONST,       // parity flag not used
        [vmi_ZF] = VMI_NOFLAG_CONST,       // zero flag not used
        [vmi_SF] = VMI_NOFLAG_CONST,       // sign flag not used
        [vmi_OF] = VMI_NOFLAG_CONST        // offset to overflow flag
    }
};

