emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Morph.c
const vmiFlags* getFlagset(enum FlagUpdate flagUpdate) {

    const vmiFlags* pflag = 0;

    switch (flagUpdate) {
        case en_flag____: pflag = 0;        break;
        case en_flag_Z__: pflag = &flagZ__; break;
        case en_flag_ZA_: pflag = &flagZ__; break;
        case en_flag___C: pflag = &flag__C; break;
        case en_flag__AC: pflag = &flag__C; break;
        case en_flag_Z_C: pflag = &flagZ_C; break;
        case en_flag_ZAC: pflag = &flagZ_C; break;
        default: MY_ASSERT(0, "getFlagset");
    }
    return pflag;
}




void doMoveRC(rl78P rl78, Uns32 bits, vmiReg rd, Uns32 c) {

    if (rl78->bol_setTo4bit == 1) {
        c = c & 0x0F;
    }

    // rd = c

    vmimtMoveRC(                //void vmimtMoveRC(
        bits,                    //    Uns32  bits,
        rd,                        //    vmiReg rd,
        c);                        //    Uns64  c
}

void doMoveRR(rl78P rl78, Uns32 bits, vmiReg rd, vmiReg ra) {

    if (rl78->bol_setTo4bit == 1) {
        vmimtBinopRRC(bits, vmi_AND, RL78_T4BIT_RA, ra, 0x0F, 0);    // 4bit
        ra = RL78_T4BIT_RA;
    }

    // rd = ra

    vmimtMoveRR(                //void vmimtMoveRR(
        bits,                    //    Uns32  bits,
        rd,                        //    vmiReg rd,
        ra);                    //    vmiReg ra
}


static void doAuxCarryRR(rl78P rl78, Uns32 bits, vmiBinop op, vmiReg rd, vmiReg ra) {

    if (rl78->sim_ac_flag != 0) {

        if (rl78->flagUpdate & 0x010) {

            vmiReg rdT = RL78_T4BIT_RD;
            vmiReg raT = RL78_T4BIT_RA;
            vmiReg rbT = RL78_T4BIT_RB;

            vmimtBinopRRC(bits, vmi_AND, raT, rd, 0x0F, 0);    // 4bit

            if (VMI_REG_EQUAL(rd, ra)) {
                rbT = raT;
            } else {
                vmimtBinopRRC(bits, vmi_AND, rbT, ra, 0x0F, 0);    // 4bit
            }

            vmimtBinopRRR(bits, op, rdT, raT, rbT, &flag_A_);
            vmimtCompareRC(bits, vmi_COND_NB, rdT, 0x10, RL78_AUXCARRY);        // not below (unsigned) : RD >= 0x10
        }
    }
}

static void doAuxCarryRC(rl78P rl78, Uns32 bits, vmiBinop op, vmiReg rd, Uns32 c) {

    if (rl78->sim_ac_flag != 0) {

        if (rl78->flagUpdate & 0x010) {

            vmiReg rdT = RL78_T4BIT_RD;
            vmiReg raT = RL78_T4BIT_RA;

            vmimtBinopRRC(bits, vmi_AND, raT, rd, 0x0F, 0);    // 4bit
            vmimtBinopRRC(bits, op, rdT, raT, c & 0x0F, &flag_A_);
            vmimtCompareRC(bits, vmi_COND_NB, rdT, 0x10, RL78_AUXCARRY);        // not below (unsigned) : RD >= 0x10
        }
    }
}

void doMulopRRR(rl78P rl78, Uns32 bits, vmiBinop op, vmiReg rd, vmiReg ra, vmiReg rb) {

    // PSW.AC flag
    doAuxCarryRR(rl78, bits, op, ra, rb);

    const vmiFlags* pflag = getFlagset(rl78->flagUpdate);

    // rd = ra <mulop> rb
    vmimtMulopRRR(            //void vmimtMulopRRR(
        bits,                    //    Uns32      bits,
        op,                        //    vmiBinop   op,
        VMI_REG_DELTA(rd,1),    //    vmiReg     rdh,
        VMI_REG_DELTA(rd,0),    //    vmiReg     rdl,
        ra,                        //    vmiReg     ra,
        rb,                        //    vmiReg     rb,
        pflag);                    //    vmiFlagsCP flags
}

void doBinopRR(rl78P rl78, Uns32 bits, vmiBinop op, vmiReg rd, vmiReg ra) {

    // PSW.AC flag
    doAuxCarryRR(rl78, bits, op, rd, ra);

    const vmiFlags* pflag = getFlagset(rl78->flagUpdate);

    // rd = rd <binop> ra
    vmimtBinopRR(                //void vmimtBinopRR(
        bits,                    //    Uns32      bits,
        op,                        //    vmiBinop   op,
        rd,                        //    vmiReg     rd,
        ra,                        //    vmiReg     ra,
        pflag);                    //    vmiFlagsCP flags
}

void doBinopRC(rl78P rl78, Uns32 bits, vmiBinop op, vmiReg rd, Uns32 c) {

    // PSW.AC flag
    doAuxCarryRC(rl78, bits, op, rd, c);

    const vmiFlags* pflag = getFlagset(rl78->flagUpdate);

    // rd = rd <binop> c
    vmimtBinopRC(                //void vmimtBinopRC(
        bits,                    //    Uns32      bits,
        op,                        //    vmiBinop   op,
        rd,                        //    vmiReg     rd,
        c,                        //    Uns64      c,
        pflag);                    //    vmiFlagsCP flags
}

void doCompareRR(rl78P rl78, Uns32 bits, vmiReg rd, vmiReg ra) {

    // using vmimtBinopRRR(), instead of vmimtCompareRR()

    // PSW.AC flag
    doAuxCarryRR(rl78, bits, vmi_SUB, rd, ra);

    const vmiFlags* pflag = getFlagset(rl78->flagUpdate);

    // rd = ra <binop> rb
    vmimtBinopRRR(                //void vmimtBinopRRR(
        bits,                    //    Uns32      bits,
        vmi_SUB,                //    vmiBinop   op,
        VMI_NOREG,                //    vmiReg     rd,
        rd,                        //    vmiReg     ra,
        ra,                        //    vmiReg     rb,
        pflag);                    //    vmiFlagsCP flags
}

void doCompareRC(rl78P rl78, Uns32 bits, vmiReg rd, Uns32 c) {

    // using vmimtBinopRRC(), instead of vmimtCompareRC()

    // PSW.AC flag
    doAuxCarryRC(rl78, bits, vmi_SUB, rd, c);

    const vmiFlags* pflag = getFlagset(rl78->flagUpdate);

    // rd = ra <binop> c
    vmimtBinopRRC(                //void vmimtBinopRRC(
        bits,                    //    Uns32      bits,
        vmi_SUB,                //    vmiBinop   op,
        VMI_NOREG,                //    vmiReg     rd,
        rd,                        //    vmiReg     ra,
        c,                        //    Uns64      c,
        pflag);                    //    vmiFlagsCP flags
}

//
// Should ES-extended address be used for load/store operation?
//
inline static Bool useESAddress(rl78P rl78) {
    return rl78->len_instPrefix == 1;
}

//
// Refine address and offset for load or store
//
static vmiReg getLoadStoreAddrRegOffset(rl78P rl78, Uns32 *offsetP, vmiReg ra) {

    if (useESAddress(rl78)) {

        // ES-based address
        *offsetP &= 0xFFFF;
        vmimtMoveRR(16, RL78_ES_ADDR, ra);
        ra = RL78_ES_ADDR;

    } else {

