emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Morph.c
        // 16-bit address, starting at 0xF0000
        *offsetP |= 0xF0000;
    }

    return ra;
}

//
// Refine address and offset depending on whether load/store uses ES-extended
// address
//
static memDomainP getLoadStoreDomainAndOffset(rl78P rl78, Uns32 *offsetP) {

    if(useESAddress(rl78)) {

        // ES-based address: use default data domain
        return 0;

    } else {

        // use 16-bit data domain and mask offset to 16 bits (an additional
        // offset of 0xF0000 is implied by this domain)
        *offsetP &= 0xFFFF;

        return rl78->dataDomain16;
    }
}

//
// If this memory access is actually an access to a memory-mapped GPR, return
// the GPR index, or -1 if it is not such an access
//
static Uns32 getMemMappedRegIndex(rl78P rl78, Uns32 bits, Uns32 offset, vmiReg ra) {

    Uns32 align = bits/8;

    if(VMI_ISNOREG(ra) && (offset>=0xFFEE0) && (offset<=0xFFEFF) && !(offset&(align-1))) {

        offset -= 0xFFEE0;

        Uns32 reg  = offset&7;
        Uns32 bank = 3-(offset/8);

        return (bank*8) + reg;

    } else {

        return -1;
    }
}


void doStoreRRO(rl78P rl78, Uns32 bits, Uns32 offset, vmiReg ra, vmiReg rb) {

    ra = getLoadStoreAddrRegOffset(rl78, &offset, ra);

    Uns32 alias = getMemMappedRegIndex(rl78, bits, offset, ra);

    if(alias!=-1) {

        // implement aligned access to GPR memory alias as register move
        vmimtMoveRR(bits, RL78_REG(alias), rb);

    } else {

        // get target domain and offset
        memDomainP domain = getLoadStoreDomainAndOffset(rl78, &offset);

        // mem[ra+offset] = rb  (when ra!=VMI_NOREG)
        // mem[offset]    = rb  (when ra==VMI_NOREG)

        memConstraint constraint = (bits == 32) ? MEM_CONSTRAINT_NONE : MEM_CONSTRAINT_ALIGNED;

        vmimtStoreRRODomain(            //void vmimtStoreRRODomain(
            domain,                     //    memDomainP    domain,
            bits,                        //    Uns32         bits,
            offset,                        //    Addr          offset,
            ra,                            //    vmiReg        ra,
            rb,                            //    vmiReg        rb,
            MEM_ENDIAN_LITTLE,            //    memEndian     endian,
            constraint);                //    memConstraint constraint        // checked by unit test MOVW_21
    }
}

void doStoreRCO(rl78P rl78, Uns32 bits, Uns32 offset, vmiReg ra, Uns32 c) {

    ra = getLoadStoreAddrRegOffset(rl78, &offset, ra);

    Uns32 alias = getMemMappedRegIndex(rl78, bits, offset, ra);

    if(alias!=-1) {

        // implement aligned access to GPR memory alias as register move
        vmimtMoveRC(bits, RL78_REG(alias), c);

    } else {

        // get target domain and offset
        memDomainP domain = getLoadStoreDomainAndOffset(rl78, &offset);

        // mem[ra+offset] = c  (when ra!=VMI_NOREG)
        // mem[offset]    = c  (when ra==VMI_NOREG)

        memConstraint constraint = (bits == 32) ? MEM_CONSTRAINT_NONE : MEM_CONSTRAINT_ALIGNED;

        vmimtStoreRCODomain(            //void vmimtStoreRCO(
            domain,                     //    memDomainP    domain,
            bits,                        //    Uns32         bits,
            offset,                        //    Addr          offset,
            ra,                            //    vmiReg        ra,
            c,                            //    Uns64         c,
            MEM_ENDIAN_LITTLE,            //    memEndian     endian,
            constraint);                //    memConstraint constraint        // checked by unit test MOVW_21
    }
}

void doLoadRRO(rl78P rl78, Uns32 bits, vmiReg rd, Uns32 offset, vmiReg ra) {

    ra = getLoadStoreAddrRegOffset(rl78, &offset, ra);

    Uns32 alias = getMemMappedRegIndex(rl78, bits, offset, ra);

    if(alias!=-1) {

        // implement aligned access to GPR memory alias as register move
        vmimtMoveRR(bits, rd, RL78_REG(alias));

    } else {

        // get target domain and offset
        memDomainP domain = getLoadStoreDomainAndOffset(rl78, &offset);

        // rd = mem[ra+offset]  (when ra!=VMI_NOREG)
        // rd = mem[offset]     (when ra==VMI_NOREG)

        // The size of the calculated address (and the size in bits of the address register
        // in the processor structure) is the specified with the processor is created (in
        // an OVP platform, this is the addressBits parameter to icmCreateProcessor; in the
        // Imperas Simulator (imperas.exe) product, this is the addresswidth attribute of
        // the DATA busmasterport entity in the XML processor description).

        memConstraint constraint = (bits == 32) ? MEM_CONSTRAINT_NONE : MEM_CONSTRAINT_ALIGNED;

        vmimtLoadRRODomain(                //void vmimtLoadRRO(
            domain,                     //    memDomainP    domain,
            bits,                        //    Uns32         destBits,
            bits,                         //    Uns32         memBits,
            offset,                         //    Addr          offset,
            rd,                            //    vmiReg        rd,
            ra,                            //    vmiReg        ra,
            MEM_ENDIAN_LITTLE,             //    memEndian     endian,
            0,                             //    Bool          signExtend,
            constraint);                //    memConstraint constraint        // checked by unit test MOVW_21
    }
}


void doSwap(Uns32 bits, vmiReg ra, vmiReg rb) {

    vmiReg rt = RL78_SWAP;
    vmimtMoveRR(bits, rt, ra);
    vmimtMoveRR(bits, ra, rb);
    vmimtMoveRR(bits, rb, rt);
}

void doJumpDir(Uns32 addr, vmiJumpHint hint) {

//    vmiMessage("I", "RL78", "doJumpDir: %08x\n", addr);

    vmimtUncondJump(            //void vmimtUncondJump(
        0,                        //    Addr        linkPC,
        addr,                    //    Addr        toAddress,
        VMI_NOREG,                //    vmiReg      linkReg,
        hint);                    //    vmiJumpHint hint
}

void doCallDir(Uns32 addr, Uns32 linkPC) {

//    vmiMessage("I", "RL78", "doCallDir: %08x\n", addr);

    vmimtUncondJump(            //void vmimtUncondJump(
        linkPC,                    //    Addr        linkPC,
        addr,                    //    Addr        toAddress,
        VMI_NOREG,                //    vmiReg      linkReg,
        vmi_JH_CALL);            //    vmiJumpHint hint
}

#define DOJUMPREL(bits, offset, hint)    doJumpRel(rl78, thisPC, bits, offset, hint)
#define DOCALLREL(bits, offset, linkPC)    doCallRel(rl78, thisPC, bits, offset, linkPC)

void doJumpRel(rl78P rl78, Uns32 thisPC, Uns32 bits, Uns32 offset, vmiJumpHint hint) {

    Uns32 addr = 0;

    if (bits == 8) {
        addr = thisPC + rl78->len_instByte + (Int8) offset;        // sign extension
    } else if (bits == 16) {
        addr = thisPC + rl78->len_instByte + (Int16) offset;    // sign extension
    } else {
        MY_ASSERT(0, "doJumpRel");
    }

