emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Morph.c
    MY_MESSAGE(rl78, "I", "doJumpRel: %08x\n", addr);

    vmimtUncondJump(            //void vmimtUncondJump(
        0,                        //    Addr        linkPC,
        addr,                    //    Addr        toAddress,
        VMI_NOREG,                //    vmiReg      linkReg,
        vmi_JH_RELATIVE | hint);    //    vmiJumpHint hint
}

void doCallRel(rl78P rl78, Uns32 thisPC, Uns32 bits, Uns32 offset, Uns32 linkPC) {

    Uns32 addr = 0;

    if (bits == 8) {
        addr = thisPC + rl78->len_instByte + (Int8) offset;        // sign extension
    } else if (bits == 16) {
        addr = thisPC + rl78->len_instByte + (Int16) offset;    // sign extension
    } else {
        MY_ASSERT(0, "doCallRel");
    }

    MY_MESSAGE(rl78, "I", "doCallRel: %08x\n", addr);

    vmimtUncondJump(            //void vmimtUncondJump(
        linkPC,                    //    Addr        linkPC,
        addr,                    //    Addr        toAddress,
        VMI_NOREG,                //    vmiReg      linkReg,
        vmi_JH_RELATIVE | vmi_JH_CALL);//    vmiJumpHint hint
}

void doJumpReg(vmiReg toReg, vmiJumpHint hint) {

    vmimtUncondJumpReg(            //void vmimtUncondJumpReg(
        0,                        //    Addr        linkPC,
        toReg,                    //    vmiReg      toReg,
        VMI_NOREG,                //    vmiReg      linkReg,
        hint);                    //    vmiJumpHint hint
}

void doCallReg(vmiReg toReg, Uns32 linkPC) {

    vmimtUncondJumpReg(            //void vmimtUncondJumpReg(
        linkPC,                    //    Addr        linkPC,
        toReg,                    //    vmiReg      toReg,
        VMI_NOREG,                //    vmiReg      linkReg,
        vmi_JH_CALL);            //    vmiJumpHint hint
}

void doCondJumpRel(rl78P rl78, Uns32 thisPC, Uns32 offset, en_Cond cond) {

    Uns32    addr = thisPC + rl78->len_instByte + (Int8) offset;
    vmiReg    flagReg = VMI_NOREG;
    Bool    jumpIfTrue = False;

    MY_MESSAGE(rl78, "I", "doCondJumpRel: %08x\n", addr);

    switch (cond) {
        case en_Cond_C    : jumpIfTrue = True ; flagReg = RL78_CARRY ; break;
        case en_Cond_Z    : jumpIfTrue = True ; flagReg = RL78_ZERO  ; break;
        case en_Cond_NC   : jumpIfTrue = False; flagReg = RL78_CARRY ; break;
        case en_Cond_NZ   : jumpIfTrue = False; flagReg = RL78_ZERO  ; break;
        case en_Cond_H    : jumpIfTrue = False; flagReg = RL78_BRANCH; break;
        case en_Cond_NH   : jumpIfTrue = True ; flagReg = RL78_BRANCH; break;
        case en_Cond_T    : jumpIfTrue = True ; flagReg = RL78_BRANCH; break;
        case en_Cond_F    : jumpIfTrue = False; flagReg = RL78_BRANCH; break;
        case en_Cond_TCLR : jumpIfTrue = True ; flagReg = RL78_BRANCH; break;
    }

    if ((cond == en_Cond_H) || (cond == en_Cond_NH)) {
        vmimtBinopRRR(                //void vmimtBinopRRR(
            8,                        //    Uns32      bits,
            vmi_OR,                    //    vmiBinop   op,
            RL78_BRANCH,            //    vmiReg     rd,
            RL78_CARRY,                //    vmiReg     ra,
            RL78_ZERO,                //    vmiReg     rb,
            0);                        //    vmiFlagsCP flags
    }

    vmimtCondJump(                //void vmimtCondJump(
        flagReg,                //    vmiReg      flag,   // byte
        jumpIfTrue,                //    Bool        jumpIfTrue,
        0,                        //    Addr        linkPC,
        addr,                    //    Addr        toAddress,
        VMI_NOREG,                //    vmiReg      linkReg,
        vmi_JH_RELATIVE);        //    vmiJumpHint hint
}


void doBitTest(en_Cond cond, vmiReg ra, Uns32 idx) {

    vmimtBinopRRC(                //void vmimtBinopRRC(
        8,                        //    Uns32      bits,
        vmi_AND,                //    vmiBinop   op,
        RL78_BRANCH,            //    vmiReg     rd,    // @@@ it may be not reasonable to set 8 bit value to Bool type.
        ra,                        //    vmiReg     ra,
        (1 << idx),                //    Uns64      c,
        0);                        //    vmiFlagsCP flags

    if (cond == en_Cond_TCLR) {
        vmiLabelP lbl_notset = vmimtNewLabel();

        Uns8 byte = ~(1 << idx);
        vmimtCondJumpLabel(RL78_BRANCH, False, lbl_notset);
        vmimtBinopRC(8, vmi_AND, ra, byte, 0);

        vmimtInsertLabel(lbl_notset);
    }
}


static void doSkip(rl78P rl78, vmiLabelP lbl_skip) {

    en_Cond cond = rl78->skipCondition;

    if (cond != en_Cond_T) {

        vmiReg    flagReg = VMI_NOREG;
        Bool    jumpIfTrue = False;

        switch (cond) {
            case en_Cond_C    : jumpIfTrue = True ; flagReg = RL78_CARRY ; break;
            case en_Cond_Z    : jumpIfTrue = True ; flagReg = RL78_ZERO  ; break;
            case en_Cond_NC   : jumpIfTrue = False; flagReg = RL78_CARRY ; break;
            case en_Cond_NZ   : jumpIfTrue = False; flagReg = RL78_ZERO  ; break;
            case en_Cond_H    : jumpIfTrue = False; flagReg = RL78_BRANCH; break;    // skip if (Z V CY) == 0    // 'V' is logical sum
            case en_Cond_NH   : jumpIfTrue = True ; flagReg = RL78_BRANCH; break;    // skip if (Z V CY) == 1
            default           : VMI_ABORT("Unexpected SKIP condition %u\n", cond);
        }

        if ((cond == en_Cond_H) || (cond == en_Cond_NH)) {
            vmimtBinopRRR(                //void vmimtBinopRRR(
                8,                        //    Uns32      bits,
                vmi_OR,                    //    vmiBinop   op,
                RL78_BRANCH,            //    vmiReg     rd,
                RL78_CARRY,                //    vmiReg     ra,
                RL78_ZERO,                //    vmiReg     rb,
                0);                        //    vmiFlagsCP flags
        }

        vmimtCondJumpLabel(flagReg, jumpIfTrue, lbl_skip);
    }
}


static void badSkip(rl78P rl78) {
    VMI_ABORT("SKIP instruction should have been merged with following instruction");
}


void doMOV1_R_IM(vmiReg rd, Uns32 idx, Uns32 val) {

    Uns8 byte;

    if (val == 0) {        // clr
        byte = ~(1 << idx);
//        vmiMessage("I", "RL78", "vmimtBinopRC: %s:%d:%08x\n", __FILE__, __LINE__, byte);
        vmimtBinopRC(8, vmi_AND, rd, byte, 0);

    } else {            // set
        byte = (1 << idx);
//        vmiMessage("I", "RL78", "vmimtBinopRC: %s:%d:%08x\n", __FILE__, __LINE__, byte);
        vmimtBinopRC(8, vmi_OR, rd, byte, 0);
    }
}

void doMOV1_R_CY(vmiReg rd, Uns32 idx, vmiReg flag) {

    vmiLabelP lbl_set  = vmimtNewLabel();
    vmiLabelP lbl_exit = vmimtNewLabel();

