emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Morph.c
    vmimtCondJumpLabel(flag, True, lbl_set);

    // clr
    Uns8 byte = ~(1 << idx);
    vmimtBinopRC(8, vmi_AND, rd, byte, 0);
    vmimtUncondJumpLabel(lbl_exit);

    // set
    vmimtInsertLabel(lbl_set);
    vmimtBinopRC(8, vmi_OR, rd, (1 << idx), 0);

    // exit
    vmimtInsertLabel(lbl_exit);
}

void doMOV1_CY_R(vmiReg flag, vmiReg rb, Uns32 idx) {

    vmimtBinopRRC(8, vmi_SHR, RL78_TBIT, rb, idx, 0);    // tmp = tmp >> idx
    vmimtBinopRC (8, vmi_AND, RL78_TBIT,     1  , 0);    // tmp = tmp & 1

    vmimtMoveRR(8, flag, RL78_TBIT);
}

void doBinop_CY_R(vmiReg flag, vmiBinop op, vmiReg rb, Uns32 idx) {

    vmimtBinopRRC(8, vmi_SHR, RL78_TBIT, rb, idx, 0);    // tmp = tmp >> idx
    vmimtBinopRC (8, vmi_AND, RL78_TBIT,     1  , 0);    // tmp = tmp & 1

    vmimtBinopRR(8, op, flag, RL78_TBIT, 0);            // Fatal (NMI_UO) 'vmimtBinopRR' unimplemented for bits=1
}


static void doPushReg(rl78P rl78, Uns32 bits, vmiReg ra) {

    vmimtBinopRC(16, vmi_SUB, RL78_SP, 2, 0);            // Fatal (NMI_UO) 'vmimtBinopRC' unimplemented for bits=20

    switch (bits) {
        case 16:
            doStoreRRO(rl78, 16, 0, RL78_SP, ra);
            break;
        case 8:
            vmimtMoveExtendRR(16, RL78_TMP, 8, ra, False);
            vmimtBinopRC(16, vmi_SHL, RL78_TMP, 8, 0);    // PSW must be stored to higher address of 2 byte area.        // checked by unit test PUSH_2
            doStoreRRO(rl78, 16, 0, RL78_SP, RL78_TMP);
            break;
    }
}

static void doPopReg(rl78P rl78, Uns32 bits, vmiReg ra) {

    switch (bits) {
        case 16:
            doLoadRRO(rl78, 16, ra, 0, RL78_SP);
            break;
        case 8:
            doLoadRRO(rl78,  8, ra, 1, RL78_SP);
            break;
    }
    vmimtBinopRC(16, vmi_ADD, RL78_SP, 2, 0);
}

static void doPushPC(rl78P rl78, Uns32 nextPC) {

    vmimtBinopRC(16, vmi_SUB, RL78_SP, 4, 0);

    // In OVP_VMI_Morph_Time_Function_Reference.pdf page.70,
    // >> Argument bits can be any multiple of eight between 8 (i.e. 1 byte) and 1024 (i.e. 128 bytes).
    // However, if bits arg is 24, an error below will happen.
    // >> Internal Abort (ABRT) /home/release/build/20150901.0/Imperas/SimCommon/source/i86/i86Emit.h:588 : Abort reached. invalid class

    doStoreRCO(rl78, 32, 0, RL78_SP, nextPC & 0xfffff);
}

static void doReset() {
    Addr offset = exceptions[RL78_EXCPT_TRP].code;
    vmimtLoadRRO(                //void vmimtLoadRRO(
        16,                        //    Uns32         destBits,
        16,                     //    Uns32         memBits,
        offset,                    //    Addr          offset,
        RL78_TMP,                //    vmiReg        rd,
        VMI_NOREG,                //    vmiReg        ra,
        MEM_ENDIAN_LITTLE,         //    memEndian     endian,
        0,                         //    Bool          signExtend,
        MEM_CONSTRAINT_NONE);    //    memConstraint constraint

    doJumpReg(RL78_TMP, vmi_JH_INT);

    vmimtEndBlock();
}

static Uns32 chkVariant(rl78P rl78, enum en_variant cond, const char* pszMnem) {

    if (rl78->variant < cond) {
//        vmiMessage("W", "RL78", "%s instruction is not supported in this variant. Reset will happen.\n", pszMnem);

        vmimtArgNatAddress((void*) "%s instruction is not supported in this variant. Reset will happen.\n");
        vmimtArgNatAddress((void*) pszMnem);
        vmimtCall((vmiCallFn) vmiPrintf);        // void vmiPrintf(const char *fmt, ...)

        doReset();
        return 1;
    } else {
        return 0;
    }
}
#define CHKVARI(cond, mnem)    if (chkVariant(rl78, en_RL78_##cond, mnem) == 1) { return; }    // return from RL78_DISPATCH_FN()

static void doBRK(rl78P rl78, Uns32 nextPC, vmiReg psw) {                        // specific function for BRK instruction

    // > If a software interrupt request is acknowledged, the contents are saved into the stacks in the order of
    // > - the program status word (PSW),
    // > - then program counter (PC),

    vmimtBinopRC(16, vmi_SUB, RL78_SP, 4, 0);

    doStoreRCO(rl78, 32, 0, RL78_SP, nextPC & 0xfffff);
    doStoreRRO(rl78,  8, 3, RL78_SP, psw);

    // > the IE flag is reset (0),
    vmimtMoveRC(8, RL78_IE, 0);

    // > and the contents of the vector table (0007EH, 0007FH) are loaded into the PC and branched.

    // call vmimtLoadRRO directly, due to not offset 0xF0000 by using doLoadRRO.
    Addr offset = exceptions[RL78_EXCPT_BRK].code;
    vmimtLoadRRO(                //void vmimtLoadRRO(
        16,                        //    Uns32         destBits,
        16,                     //    Uns32         memBits,
        offset,                    //    Addr          offset,
        RL78_TMP,                //    vmiReg        rd,
        VMI_NOREG,                //    vmiReg        ra,
        MEM_ENDIAN_LITTLE,         //    memEndian     endian,
        0,                         //    Bool          signExtend,
        MEM_CONSTRAINT_NONE);    //    memConstraint constraint

    doJumpReg(RL78_TMP, vmi_JH_CALLINT);

    vmimtEndBlock();
}

static void doPopPC(rl78P rl78) {

    doLoadRRO(rl78, 32, RL78_TMP  , 0, RL78_SP);
    vmimtBinopRC(32, vmi_AND, RL78_TMP, 0xFFFFF, 0);

    vmimtBinopRC(16, vmi_ADD, RL78_SP, 4, 0);
}

static void doSetPSW() {
    vmimtArgProcessor();
    vmimtCall((vmiCallFn) rl78SetPSW_BIT);                // Update BIT members from PSW vari.
}

static void doGetPSW(vmiReg rd) {
    vmimtArgProcessor();
    vmimtCallResult((vmiCallFn) rl78GetPSW_REG, 8, rd);    // Update PSW vari from BIT members.
}

static void doRETI(rl78P rl78) {

    doLoadRRO(rl78, 32, RL78_TMP  , 0, RL78_SP);

    vmimtMoveRR(8, RL78_PSW, RL78_TMP_B3);
    doSetPSW();                        // Update BIT members from PSW vari.

    vmimtBinopRC(32, vmi_AND, RL78_TMP, 0xFFFFF, 0);

    vmimtBinopRC(16, vmi_ADD, RL78_SP, 4, 0);

    vmimtArgNatAddress((void*) rl78);
    vmimtCall((vmiCallFn) rl78InterruptNext);        // process pending interrupt.
}
static void doRETB(rl78P rl78) { doRETI(rl78); }

