emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Morph.c
static void doEI(rl78P rl78) {
    vmimtArgNatAddress((void*) rl78);
    vmimtCall((vmiCallFn) rl78InterruptNext);        // process pending interrupt.
}


static void doCMPS(rl78P rl78, vmiReg dst, vmiReg src) {                    // specific function for CMPS instruction

    vmiReg reg_A = reg_read_8(rl78, R_A);

    // PSW.Z, PSW.AC
    doCompareRR(rl78, 8, dst, src);

    // PSW.CY = (PSW.Z == 0) or (A == 0) or (dst == 0)
    vmimtCompareRC(8, vmi_COND_EQ, RL78_ZERO, 0, RL78_CARRY);    // PSW.CY <- (PSW.Z == 0)

    vmimtCompareRC(8, vmi_COND_EQ, reg_A    , 0, RL78_TCMPS);    // (A == 0)
    vmimtBinopRR(8, vmi_OR, RL78_CARRY, RL78_TCMPS, 0);

    vmimtCompareRC(8, vmi_COND_EQ, dst      , 0, RL78_TCMPS);    // (dst == 0)
    vmimtBinopRR(8, vmi_OR, RL78_CARRY, RL78_TCMPS, 0);
}

static void doMOVS(rl78P rl78, Uns32 offset, vmiReg dst, vmiReg src) {        // specific function for MOVS instruction

    vmiReg reg_A = reg_read_8(rl78, R_A);

    // PSW.Z = (src == 0)
    vmimtCompareRC(8, vmi_COND_EQ, src, 0, RL78_ZERO);

    // PSW.CY = (A == 0) or (src == 0)
    vmimtCompareRC(8, vmi_COND_EQ, reg_A    , 0, RL78_CARRY);    // (A == 0)
    vmimtBinopRR(8, vmi_OR, RL78_CARRY, RL78_ZERO, 0);

    doStoreRRO(rl78, 8, offset, dst, src);
}

static void doSEL(rl78P rl78, Uns32 op1) {                                    // specific function for SEL instruction

    if(op1!=rl78->PSW_RBS) {

        vmimtMoveRC(8, RL78_RBS, op1);

        vmimtArgProcessor();
        vmimtArgUns32(op1);
        vmimtCall((vmiCallFn) vmirtSetMode);    // Bool vmirtSetMode(vmiProcessorP processor, Uns32 dictionaryIndex);

        vmimtEndBlock();
    }
}

static void doHALT(rl78P rl78) {                                            // specific function for HALT instruction

    if (rl78->exit_on_halt == 0) {
        vmimtArgProcessor();
        vmimtCall((vmiCallFn) vmirtHalt);

    } else {
        vmimtArgNatAddress((void*) "HALT instruction executed.\n");
        vmimtCall((vmiCallFn) vmiPrintf);        // void vmiPrintf(const char *fmt, ...)

        vmimtArgProcessor();
        vmimtCall((vmiCallFn) dumpRAM);

        vmimtArgProcessor();
        vmimtCall((vmiCallFn) vmirtExit);        // void vmirtExit(vmiProcessorP processor);
    }

    vmimtEndBlock();
}

static void doSTOP(rl78P rl78) {

    vmimtHalt();
}

static void doCALLT(Uns32 op2, Uns32 op1, Uns32 linkPC) {                // specific function for CALLT instruction

    Uns32 tbladr = 0x0080 + (op2 << 4) + (op1 << 1);    // 0080h - 00BEh

    // call vmimtLoadRRO directly, due to not offset 0xF0000 by using doLoadRRO.
    vmimtLoadRRO(                //void vmimtLoadRRO(
        16,                        //    Uns32         destBits,
        16,                     //    Uns32         memBits,
        tbladr,                     //    Addr          offset,
        RL78_TMP,                //    vmiReg        rd,
        VMI_NOREG,                //    vmiReg        ra,
        MEM_ENDIAN_LITTLE,         //    memEndian     endian,
        0,                         //    Bool          signExtend,
        MEM_CONSTRAINT_NONE);    //    memConstraint constraint

    doCallReg(RL78_TMP, linkPC);
}

#if 0
static void doNotImpl() {

    vmimtArgNatAddress((void*) "not implemented.\n");
    vmimtCall((vmiCallFn) vmiPrintf);        // void vmiPrintf(const char *fmt, ...)

    vmimtArgProcessor();
    vmimtCall((vmiCallFn) vmirtExit);        // void vmirtExit(vmiProcessorP processor);
}
#endif


// address adjustment
#define    SADDR(opx)                    IMM1(opx); opx += (opx < 0x20) ? 0xFFF00 : 0xFFE00;        // FFE20h-FFF1Fh
#define    SFR(opx)                    IMM1(opx); opx += 0xFFF00;

// short naming
#define READ_16(ireg)                reg_read_16(rl78, ireg)
#define WRIT_16(ireg)                reg_write_16(rl78, ireg)
#define WRIT_32(ireg)                /* no action */
#define LOAD_A(bits, addr)            doLoadRRO(rl78, bits, tmp, addr, VMI_NOREG);
#define LOAD_R(bits, offset, ra)    doLoadRRO(rl78, bits, tmp, offset, ra);
#define    LOAD_W(bits, op3, rb)        { prepareTHL(rl78, op3, rb); doLoadRRO(rl78, bits, tmp, 0, RL78_THL); }
#define    STOR_A(bits, addr)            doStoreRRO(rl78, bits, addr, VMI_NOREG, tmp);
#define    STOR_R(bits, offset, rd)    doStoreRRO(rl78, bits, offset, rd, tmp);
#define    STOR_W(bits, op3, rb)        { prepareTHL(rl78, op3, rb); doStoreRRO(rl78, bits, 0, RL78_THL, tmp); }
#define ADDR_CS(reg)                { vmimtMoveRR (16, RL78_CS_ADDR, reg); }


// prepare for operand register
#define    PRE_REG_16_16()                rg1 = reg_read_16(rl78, op1); rg2 = reg_read_16(rl78, op2);
#define    PRE_REG_16__8()                rg1 = reg_read_16(rl78, op1); rg2 = reg_read_8 (rl78, op2);
#define    PRE_REG_16_x8()                rg1 = reg_read_16(rl78, op1); rg2 = reg_read_x8(rl78, op2);
#define    PRE_REG_16_no()                rg1 = reg_read_16(rl78, op1); rg2 = VMI_NOREG;
#define    PRE_REG__8_16()                rg1 = reg_read_8 (rl78, op1); rg2 = reg_read_16(rl78, op2); if ((op1 == R_ES) || (op1 == R_CS)) { rl78->bol_setTo4bit = 1; };
#define    PRE_REG_x8_16()                rg1 = reg_read_x8(rl78, op1); rg2 = reg_read_16(rl78, op2); if ((op1 == R_ES) || (op1 == R_CS)) { rl78->bol_setTo4bit = 1; };
#define    PRE_REG__8__8()                rg1 = reg_read_8 (rl78, op1); rg2 = reg_read_8 (rl78, op2); if ((op1 == R_ES) || (op1 == R_CS)) { rl78->bol_setTo4bit = 1; };
#define    PRE_REG_x8__8()                rg1 = reg_read_x8(rl78, op1); rg2 = reg_read_8 (rl78, op2); if ((op1 == R_ES) || (op1 == R_CS)) { rl78->bol_setTo4bit = 1; };
#define    PRE_REG__8_x8()                rg1 = reg_read_8 (rl78, op1); rg2 = reg_read_x8(rl78, op2); if ((op1 == R_ES) || (op1 == R_CS)) { rl78->bol_setTo4bit = 1; };
#define    PRE_REG__8_no()                rg1 = reg_read_8 (rl78, op1); rg2 = VMI_NOREG;              if ((op1 == R_ES) || (op1 == R_CS)) { rl78->bol_setTo4bit = 1; };
#define    PRE_REG_x8_no()                rg1 = reg_read_x8(rl78, op1); rg2 = VMI_NOREG;              if ((op1 == R_ES) || (op1 == R_CS)) { rl78->bol_setTo4bit = 1; };
#define    PRE_REG_no_16()                rg1 = VMI_NOREG;              rg2 = reg_read_16(rl78, op2);
#define    PRE_REG_no__8()                rg1 = VMI_NOREG;              rg2 = reg_read_8 (rl78, op2);
#define    PRE_REG_no_no()                rg1 = VMI_NOREG;              rg2 = VMI_NOREG;
#define    PRE_REG_32_32()                rg1 = reg_read_32(rl78, op1); rg2 = reg_read_32(rl78, op2);


#include "rl78Morph_S3ext.h"


