emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Morph.c
//#pragma GCC diagnostic push
//#pragma GCC diagnostic ignored "-Wunused-variable"
//#pragma GCC diagnostic ignored "-Wunused-but-set-variable"

// #define RL78_DISPATCH_FN(_NAME) void _NAME( 
//     rl78P rl78,         
//     Uns32 thisPC,       
//     Uns8* instr,        
//     void *userData      
// )
//                                                       | decoding operand                             prepare operand                          upd PSW   do execute                              output                |
static RL78_DISPATCH_FN(rl78Morph_1_00_NOP      ) { PRE();                                                                                       FLG(___);                                                                 PST(); }    // NOP
static RL78_DISPATCH_FN(rl78Morph_1_02_ADDW     ) { PRE();            op1=R_AX ;            IMM2(op2);  PRE_REG_16_no(); LOAD_A(16, op2);        FLG(ZAC); doBinopRR(rl78, 16, vmi_ADD, rg1, tmp); WRIT_16(op1);        PST(); }    // ADDW    AX, !addr16
static RL78_DISPATCH_FN(rl78Morph_1_04_ADDW     ) { PRE();            op1=R_AX ;            IMM2(op2);  PRE_REG_16_no();                         FLG(ZAC); doBinopRC(rl78, 16, vmi_ADD, rg1, op2); WRIT_16(op1);        PST(); }    // ADDW    AX, #word
static RL78_DISPATCH_FN(rl78Morph_1_06_ADDW     ) { PRE();            op1=R_AX ;            SADDR(op2); PRE_REG_16_no(); LOAD_A(16, op2);        FLG(ZAC); doBinopRR(rl78, 16, vmi_ADD, rg1, tmp); WRIT_16(op1);        PST(); }    // ADDW    AX, saddrp
static RL78_DISPATCH_FN(rl78Morph_1_0X_ADDW     ) { PRE();            op1=R_AX ;            BIT2(op2);  PRE_REG_16_16();                         FLG(ZAC); doBinopRR(rl78, 16, vmi_ADD, rg1, rg2); WRIT_16(op1);        PST(); }    // ADDW    AX, ??
static RL78_DISPATCH_FN(rl78Morph_1_08_XCH      ) { PRE();            op1=R_A  ;            op2=R_X  ;  PRE_REG__8__8();                         FLG(___); doSwap(8, rg1, rg2);                                            PST(); }    // XCH     A, X
static RL78_DISPATCH_FN(rl78Morph_1_09_MOV      ) { PRE();            op1=R_A  ; IMM2(dis); op2=R_B  ;  PRE_REG__8_x8(); LOAD_R(8, dis, rg2);    FLG(___); doMoveRR(rl78, 8, rg1, tmp);                                    PST(); }    // MOV     A, word[B]
static RL78_DISPATCH_FN(rl78Morph_1_0A_ADD      ) { PRE();            SADDR(op1);           IMM1(op2);  PRE_REG_no_no(); LOAD_A(8, op1);         FLG(ZAC); doBinopRC(rl78, 8, vmi_ADD, tmp, op2);  STOR_A(8, op1);        PST(); }    // ADD     saddr, #byte
static RL78_DISPATCH_FN(rl78Morph_1_0B_ADD      ) { PRE();            op1=R_A  ;            SADDR(op2); PRE_REG__8_no(); LOAD_A(8, op2);         FLG(ZAC); doBinopRR(rl78, 8, vmi_ADD, rg1, tmp);                          PST(); }    // ADD     A, saddr
static RL78_DISPATCH_FN(rl78Morph_1_0C_ADD      ) { PRE();            op1=R_A  ;            IMM1(op2);  PRE_REG__8_no();                         FLG(ZAC); doBinopRC(rl78, 8, vmi_ADD, rg1, op2);                          PST(); }    // ADD     A, #byte
static RL78_DISPATCH_FN(rl78Morph_1_0D_ADD      ) { PRE();            op1=R_A  ;            op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8,   0, rg2);    FLG(ZAC); doBinopRR(rl78, 8, vmi_ADD, rg1, tmp);                          PST(); }    // ADD     A, [HL]
static RL78_DISPATCH_FN(rl78Morph_1_0E_ADD      ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8, dis, rg2);    FLG(ZAC); doBinopRR(rl78, 8, vmi_ADD, rg1, tmp);                          PST(); }    // ADD     A, [HL+byte]
static RL78_DISPATCH_FN(rl78Morph_1_0F_ADD      ) { PRE();            op1=R_A  ;            IMM2(op2);  PRE_REG__8_no(); LOAD_A(8, op2);         FLG(ZAC); doBinopRR(rl78, 8, vmi_ADD, rg1, tmp);                          PST(); }    // ADD     A, !addr16
static RL78_DISPATCH_FN(rl78Morph_1_10_ADDW     ) { PRE();            op1=R_SP ;            IMM1(op2);  PRE_REG_16_no();                         FLG(___); doBinopRC(rl78, 16, vmi_ADD, rg1, op2); /* NO flg update */    PST(); }    // ADDW    SP, #byte
static RL78_DISPATCH_FN(rl78Morph_1_11_PREFIX   ) { PRE();                                                                                                                                                                 PST(); }    // PREFIX
static RL78_DISPATCH_FN(rl78Morph_1_1X_MOVW     ) { PRE();            BIT2(op1);            op2=R_AX ;  PRE_REG_16_16();                         FLG(___); doMoveRR(rl78, 16, rg1, rg2);           WRIT_16(op1);        PST(); }    // MOVW    ??, AX
static RL78_DISPATCH_FN(rl78Morph_1_1Y_MOVW     ) { PRE();            op1=R_AX ;            BIT2(op2);  PRE_REG_16_16();                         FLG(___); doMoveRR(rl78, 16, rg1, rg2);           WRIT_16(op1);        PST(); }    // MOVW    AX, ??
static RL78_DISPATCH_FN(rl78Morph_1_18_MOV      ) { PRE(); IMM2(dis); op1=R_B  ;            op2=R_A  ;  PRE_REG_x8__8();                         FLG(___); doStoreRRO(rl78, 8, dis, rg1, rg2);                             PST(); }    // MOV     word[B], A
static RL78_DISPATCH_FN(rl78Morph_1_19_MOV      ) { PRE(); IMM2(dis); op1=R_B  ;            IMM1(op2);  PRE_REG_x8_no();                         FLG(___); doStoreRCO(rl78, 8, dis, rg1, op2);                             PST(); }    // MOV     word[B], #byte
static RL78_DISPATCH_FN(rl78Morph_1_1A_ADDC     ) { PRE();            SADDR(op1);           IMM1(op2);  PRE_REG_no_no(); LOAD_A(8, op1);         FLG(ZAC); doBinopRC(rl78, 8, vmi_ADC, tmp, op2);  STOR_A(8, op1);        PST(); }    // ADDC    saddr, #byte
static RL78_DISPATCH_FN(rl78Morph_1_1B_ADDC     ) { PRE();            op1=R_A  ;            SADDR(op2); PRE_REG__8_no(); LOAD_A(8, op2);         FLG(ZAC); doBinopRR(rl78, 8, vmi_ADC, rg1, tmp);                          PST(); }    // ADDC    A, saddr
static RL78_DISPATCH_FN(rl78Morph_1_1C_ADDC     ) { PRE();            op1=R_A  ;            IMM1(op2);  PRE_REG__8_no();                         FLG(ZAC); doBinopRC(rl78, 8, vmi_ADC, rg1, op2);                          PST(); }    // ADDC    A, #byte
static RL78_DISPATCH_FN(rl78Morph_1_1D_ADDC     ) { PRE();            op1=R_A  ;            op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8,   0, rg2);    FLG(ZAC); doBinopRR(rl78, 8, vmi_ADC, rg1, tmp);                          PST(); }    // ADDC    A, [HL]
static RL78_DISPATCH_FN(rl78Morph_1_1E_ADDC     ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8, dis, rg2);    FLG(ZAC); doBinopRR(rl78, 8, vmi_ADC, rg1, tmp);                          PST(); }    // ADDC    A, [HL+byte]
static RL78_DISPATCH_FN(rl78Morph_1_1F_ADDC     ) { PRE();            op1=R_A  ;            IMM2(op2);  PRE_REG__8_no(); LOAD_A(8, op2);         FLG(ZAC); doBinopRR(rl78, 8, vmi_ADC, rg1, tmp);                          PST(); }    // ADDC    A, !addr16
static RL78_DISPATCH_FN(rl78Morph_1_20_SUBW     ) { PRE();            op1=R_SP ;            IMM1(op2);  PRE_REG_16_no();                         FLG(___); doBinopRC(rl78, 16, vmi_SUB, rg1, op2); /* NO flg update */    PST(); }    // SUBW    SP, #byte
static RL78_DISPATCH_FN(rl78Morph_1_22_SUBW     ) { PRE();            op1=R_AX ;            IMM2(op2);  PRE_REG_16_no(); LOAD_A(16, op2);        FLG(ZAC); doBinopRR(rl78, 16, vmi_SUB, rg1, tmp); WRIT_16(op1);        PST(); }    // SUBW    AX, !addr16
static RL78_DISPATCH_FN(rl78Morph_1_24_SUBW     ) { PRE();            op1=R_AX ;            IMM2(op2);  PRE_REG_16_no();                         FLG(ZAC); doBinopRC(rl78, 16, vmi_SUB, rg1, op2); WRIT_16(op1);        PST(); }    // SUBW    AX, #word
static RL78_DISPATCH_FN(rl78Morph_1_26_SUBW     ) { PRE();            op1=R_AX ;            SADDR(op2); PRE_REG_16_no(); LOAD_A(16, op2);        FLG(ZAC); doBinopRR(rl78, 16, vmi_SUB, rg1, tmp); WRIT_16(op1);        PST(); }    // SUBW    AX, saddrp
static RL78_DISPATCH_FN(rl78Morph_1_2X_SUBW     ) { PRE();            op1=R_AX ;            BIT2(op2);  PRE_REG_16_16();                         FLG(ZAC); doBinopRR(rl78, 16, vmi_SUB, rg1, rg2); WRIT_16(op1);        PST(); }    // SUBW    AX, ??                // 0x21 'SUBW AX,AX'�͖���`����
static RL78_DISPATCH_FN(rl78Morph_1_28_MOV      ) { PRE(); IMM2(dis); op1=R_C  ;            op2=R_A  ;  PRE_REG_x8__8();                         FLG(___); doStoreRRO(rl78, 8, dis, rg1, rg2);                             PST(); }    // MOV     word[C] ,A
static RL78_DISPATCH_FN(rl78Morph_1_29_MOV      ) { PRE();            op1=R_A  ; IMM2(dis); op2=R_C  ;  PRE_REG__8_x8(); LOAD_R(8, dis, rg2);    FLG(___); doMoveRR(rl78, 8, rg1, tmp);                                    PST(); }    // MOV     A, word[C]
static RL78_DISPATCH_FN(rl78Morph_1_2A_SUB      ) { PRE();            SADDR(op1);           IMM1(op2);  PRE_REG_no_no(); LOAD_A(8, op1);         FLG(ZAC); doBinopRC(rl78, 8, vmi_SUB, tmp, op2);  STOR_A(8, op1);        PST(); }    // SUB     saddr, #byte
static RL78_DISPATCH_FN(rl78Morph_1_2B_SUB      ) { PRE();            op1=R_A  ;            SADDR(op2); PRE_REG__8_no(); LOAD_A(8, op2);         FLG(ZAC); doBinopRR(rl78, 8, vmi_SUB, rg1, tmp);                          PST(); }    // SUB     A, saddr
static RL78_DISPATCH_FN(rl78Morph_1_2C_SUB      ) { PRE();            op1=R_A  ;            IMM1(op2);  PRE_REG__8_no();                         FLG(ZAC); doBinopRC(rl78, 8, vmi_SUB, rg1, op2);                          PST(); }    // SUB     A, #byte
static RL78_DISPATCH_FN(rl78Morph_1_2D_SUB      ) { PRE();            op1=R_A  ;            op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8,   0, rg2);    FLG(ZAC); doBinopRR(rl78, 8, vmi_SUB, rg1, tmp);                          PST(); }    // SUB     A, [HL]
static RL78_DISPATCH_FN(rl78Morph_1_2E_SUB      ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8, dis, rg2);    FLG(ZAC); doBinopRR(rl78, 8, vmi_SUB, rg1, tmp);                          PST(); }    // SUB     A, [HL+byte]
static RL78_DISPATCH_FN(rl78Morph_1_2F_SUB      ) { PRE();            op1=R_A  ;            IMM2(op2);  PRE_REG__8_no(); LOAD_A(8, op2);         FLG(ZAC); doBinopRR(rl78, 8, vmi_SUB, rg1, tmp);                          PST(); }    // SUB     A, !addr16
static RL78_DISPATCH_FN(rl78Morph_1_31_4thmap   ) { PRE();                                                                                                                                                                 PST(); }    // 4thmap
static RL78_DISPATCH_FN(rl78Morph_1_3X_XCHW     ) { PRE();            op1=R_AX ;            BIT2(op2);  PRE_REG_16_16();                         FLG(___); doSwap(16, rg1, rg2);     WRIT_16(op1); WRIT_16(op2);        PST(); }    // XCHW    AX, ??
static RL78_DISPATCH_FN(rl78Morph_1_3Y_MOVW     ) { PRE();            BIT2(op1);            IMM2(op2);  PRE_REG_16_no();                         FLG(___); doMoveRC(rl78, 16, rg1, op2);           WRIT_16(op1);        PST(); }    // MOVW    ??, #word
static RL78_DISPATCH_FN(rl78Morph_1_38_MOV      ) { PRE(); IMM2(dis); op1=R_C  ;            IMM1(op2);  PRE_REG_x8_no();                         FLG(___); doStoreRCO(rl78, 8, dis, rg1, op2);                             PST(); }    // MOV     word[C], #byte
static RL78_DISPATCH_FN(rl78Morph_1_39_MOV      ) { PRE(); IMM2(dis); op1=R_BC ;            IMM1(op2);  PRE_REG_16_no();                         FLG(___); doStoreRCO(rl78, 8, dis, rg1, op2);                             PST(); }    // MOV     word[BC], #byte
static RL78_DISPATCH_FN(rl78Morph_1_3A_SUBC     ) { PRE();            SADDR(op1);           IMM1(op2);  PRE_REG_no_no(); LOAD_A(8, op1);         FLG(ZAC); doBinopRC(rl78, 8, vmi_SBB, tmp, op2);  STOR_A(8, op1);        PST(); }    // SUBC    saddr, #byte            //d <- a - b - C
static RL78_DISPATCH_FN(rl78Morph_1_3B_SUBC     ) { PRE();            op1=R_A  ;            SADDR(op2); PRE_REG__8_no(); LOAD_A(8, op2);         FLG(ZAC); doBinopRR(rl78, 8, vmi_SBB, rg1, tmp);                          PST(); }    // SUBC    A, saddr
static RL78_DISPATCH_FN(rl78Morph_1_3C_SUBC     ) { PRE();            op1=R_A  ;            IMM1(op2);  PRE_REG__8_no();                         FLG(ZAC); doBinopRC(rl78, 8, vmi_SBB, rg1, op2);                          PST(); }    // SUBC    A, #byte
static RL78_DISPATCH_FN(rl78Morph_1_3D_SUBC     ) { PRE();            op1=R_A  ;            op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8,   0, rg2);    FLG(ZAC); doBinopRR(rl78, 8, vmi_SBB, rg1, tmp);                          PST(); }    // SUBC    A, [HL]
static RL78_DISPATCH_FN(rl78Morph_1_3E_SUBC     ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8, dis, rg2);    FLG(ZAC); doBinopRR(rl78, 8, vmi_SBB, rg1, tmp);                          PST(); }    // SUBC    A, [HL+byte]
static RL78_DISPATCH_FN(rl78Morph_1_3F_SUBC     ) { PRE();            op1=R_A  ;            IMM2(op2);  PRE_REG__8_no(); LOAD_A(8, op2);         FLG(ZAC); doBinopRR(rl78, 8, vmi_SBB, rg1, tmp);                          PST(); }    // SUBC    A, !addr16
static RL78_DISPATCH_FN(rl78Morph_1_40_CMP      ) { PRE();            IMM2(op1);            IMM1(op2);  PRE_REG_no_no(); LOAD_A(8, op1);         FLG(ZAC); doCompareRC(rl78, 8, tmp, op2);                                 PST(); }    // CMP     !addr16, #byte
static RL78_DISPATCH_FN(rl78Morph_1_41_MOV      ) { PRE();            op1=R_ES ;            IMM1(op2);  PRE_REG__8_no();                         FLG(___); doMoveRC(rl78, 16, rg1, op2);                                   PST(); }    // MOV     ES, #byte
static RL78_DISPATCH_FN(rl78Morph_1_42_CMPW     ) { PRE();            op1=R_AX ;            IMM2(op2);  PRE_REG_16_no(); LOAD_A(16, op2);        FLG(ZAC); doCompareRR(rl78, 16, rg1, tmp);                                PST(); }    // CMPW    AX, !addr16
static RL78_DISPATCH_FN(rl78Morph_1_44_CMPW     ) { PRE();            op1=R_AX ;            IMM2(op2);  PRE_REG_16_no();                         FLG(ZAC); doCompareRC(rl78, 16, rg1, op2);                                PST(); }    // CMPW    AX, #word
static RL78_DISPATCH_FN(rl78Morph_1_46_CMPW     ) { PRE();            op1=R_AX ;            SADDR(op2); PRE_REG_16_no(); LOAD_A(16, op2);        FLG(ZAC); doCompareRR(rl78, 16, rg1, tmp);                                PST(); }    // CMPW    AX, saddrp
static RL78_DISPATCH_FN(rl78Morph_1_4X_CMPW     ) { PRE();            op1=R_AX ;            BIT2(op2);  PRE_REG_16_16();                         FLG(ZAC); doCompareRR(rl78, 16, rg1, rg2);                                PST(); }    // CMPW    AX, ??
static RL78_DISPATCH_FN(rl78Morph_1_48_MOV      ) { PRE(); IMM2(dis); op1=R_BC ;            op2=R_A  ;  PRE_REG_16__8();                         FLG(___); doStoreRRO(rl78, 8, dis, rg1, rg2);                             PST(); }    // MOV     word[BC], A
static RL78_DISPATCH_FN(rl78Morph_1_49_MOV      ) { PRE();            op1=R_A  ; IMM2(dis); op2=R_BC ;  PRE_REG__8_16(); LOAD_R(8, dis, rg2);    FLG(___); doMoveRR(rl78, 8, rg1, tmp);                                    PST(); }    // MOV     A, word[BC]
static RL78_DISPATCH_FN(rl78Morph_1_4A_CMP      ) { PRE();            SADDR(op1);           IMM1(op2);  PRE_REG_no_no(); LOAD_A(8, op1);         FLG(ZAC); doCompareRC(rl78, 8, tmp, op2);                                 PST(); }    // CMP     saddr, #byte
static RL78_DISPATCH_FN(rl78Morph_1_4B_CMP      ) { PRE();            op1=R_A  ;            SADDR(op2); PRE_REG__8_no(); LOAD_A(8, op2);         FLG(ZAC); doCompareRR(rl78, 8, rg1, tmp);                                 PST(); }    // CMP     A, saddr
static RL78_DISPATCH_FN(rl78Morph_1_4C_CMP      ) { PRE();            op1=R_A  ;            IMM1(op2);  PRE_REG__8_no();                         FLG(ZAC); doCompareRC(rl78, 8, rg1, op2);                                 PST(); }    // CMP     A, #byte
static RL78_DISPATCH_FN(rl78Morph_1_4D_CMP      ) { PRE();            op1=R_A  ;            op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8,   0, rg2);    FLG(ZAC); doCompareRR(rl78, 8, rg1, tmp);                                 PST(); }    // CMP     A, [HL]
static RL78_DISPATCH_FN(rl78Morph_1_4E_CMP      ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8, dis, rg2);    FLG(ZAC); doCompareRR(rl78, 8, rg1, tmp);                                 PST(); }    // CMP     A, [HL+byte]
static RL78_DISPATCH_FN(rl78Morph_1_4F_CMP      ) { PRE();            op1=R_A  ;            IMM2(op2);  PRE_REG__8_no(); LOAD_A(8, op2);         FLG(ZAC); doCompareRR(rl78, 8, rg1, tmp);                                 PST(); }    // CMP     A, !addr16
static RL78_DISPATCH_FN(rl78Morph_1_5X_MOV      ) { PRE();            BIT3(op1);            IMM1(op2);  PRE_REG__8_no();                         FLG(___); doMoveRC(rl78, 8, rg1, op2);                                    PST(); }    // MOV     ?, #byte
static RL78_DISPATCH_FN(rl78Morph_1_58_MOVW     ) { PRE(); IMM2(dis); op1=R_B  ;            op2=R_AX ;  PRE_REG_x8_16();                         FLG(___); doStoreRRO(rl78, 16, dis, rg1, rg2);                            PST(); }    // MOVW    word[B], AX
static RL78_DISPATCH_FN(rl78Morph_1_59_MOVW     ) { PRE();            op1=R_AX ; IMM2(dis); op2=R_B  ;  PRE_REG_16_x8(); LOAD_R(16, dis, rg2);   FLG(___); doMoveRR(rl78, 16, rg1, tmp);           WRIT_16(op1);        PST(); }    // MOVW    AX, word[B]
static RL78_DISPATCH_FN(rl78Morph_1_5A_AND      ) { PRE();            SADDR(op1);           IMM1(op2);  PRE_REG_no_no(); LOAD_A(8, op1);         FLG(Z__); doBinopRC(rl78, 8, vmi_AND, tmp, op2);  STOR_A(8, op1);        PST(); }    // AND     saddr, #byte
static RL78_DISPATCH_FN(rl78Morph_1_5B_AND      ) { PRE();            op1=R_A  ;            SADDR(op2); PRE_REG__8_no(); LOAD_A(8, op2);         FLG(Z__); doBinopRR(rl78, 8, vmi_AND, rg1, tmp);                          PST(); }    // AND     A, saddr
static RL78_DISPATCH_FN(rl78Morph_1_5C_AND      ) { PRE();            op1=R_A  ;            IMM1(op2);  PRE_REG__8_no();                         FLG(Z__); doBinopRC(rl78, 8, vmi_AND, rg1, op2);                          PST(); }    // AND     A, #byte
static RL78_DISPATCH_FN(rl78Morph_1_5D_AND      ) { PRE();            op1=R_A  ;            op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8,   0, rg2);    FLG(Z__); doBinopRR(rl78, 8, vmi_AND, rg1, tmp);                          PST(); }    // AND     A, [HL]
static RL78_DISPATCH_FN(rl78Morph_1_5E_AND      ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8, dis, rg2);    FLG(Z__); doBinopRR(rl78, 8, vmi_AND, rg1, tmp);                          PST(); }    // AND     A, [HL+byte]
static RL78_DISPATCH_FN(rl78Morph_1_5F_AND      ) { PRE();            op1=R_A  ;            IMM2(op2);  PRE_REG__8_no(); LOAD_A(8, op2);         FLG(Z__); doBinopRR(rl78, 8, vmi_AND, rg1, tmp);                          PST(); }    // AND     A, !addr16
static RL78_DISPATCH_FN(rl78Morph_1_61_2ndmap   ) { PRE();                                                                                                                                                                 PST(); }    // 2ndmap
static RL78_DISPATCH_FN(rl78Morph_1_6X_MOV      ) { PRE();            op1=R_A  ;            BIT3(op2);  PRE_REG__8__8();                         FLG(___); doMoveRR(rl78, 8, rg1, rg2);                                    PST(); }    // MOV     A, ?
static RL78_DISPATCH_FN(rl78Morph_1_68_MOVW     ) { PRE(); IMM2(dis); op1=R_C  ;            op2=R_AX ;  PRE_REG_x8_16();                         FLG(___); doStoreRRO(rl78, 16, dis, rg1, rg2);                            PST(); }    // MOVW    word[C], AX
static RL78_DISPATCH_FN(rl78Morph_1_69_MOVW     ) { PRE();            op1=R_AX ; IMM2(dis); op2=R_C  ;  PRE_REG_16_x8(); LOAD_R(16, dis, rg2);   FLG(___); doMoveRR(rl78, 16, rg1, tmp);           WRIT_16(op1);        PST(); }    // MOVW    AX, word[C]
static RL78_DISPATCH_FN(rl78Morph_1_6A_OR       ) { PRE();            SADDR(op1);           IMM1(op2);  PRE_REG_no_no(); LOAD_A(8, op1);         FLG(Z__); doBinopRC(rl78, 8, vmi_OR , tmp, op2);  STOR_A(8, op1);        PST(); }    // OR      saddr, #byte
static RL78_DISPATCH_FN(rl78Morph_1_6B_OR       ) { PRE();            op1=R_A  ;            SADDR(op2); PRE_REG__8_no(); LOAD_A(8, op2);         FLG(Z__); doBinopRR(rl78, 8, vmi_OR , rg1, tmp);                          PST(); }    // OR      A, saddr
static RL78_DISPATCH_FN(rl78Morph_1_6C_OR       ) { PRE();            op1=R_A  ;            IMM1(op2);  PRE_REG__8_no();                         FLG(Z__); doBinopRC(rl78, 8, vmi_OR , rg1, op2);                          PST(); }    // OR      A, #byte
static RL78_DISPATCH_FN(rl78Morph_1_6D_OR       ) { PRE();            op1=R_A  ;            op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8,   0, rg2);    FLG(Z__); doBinopRR(rl78, 8, vmi_OR , rg1, tmp);                          PST(); }    // OR      A, [HL]
static RL78_DISPATCH_FN(rl78Morph_1_6E_OR       ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8, dis, rg2);    FLG(Z__); doBinopRR(rl78, 8, vmi_OR , rg1, tmp);                          PST(); }    // OR      A, [HL+byte]
static RL78_DISPATCH_FN(rl78Morph_1_6F_OR       ) { PRE();            op1=R_A  ;            IMM2(op2);  PRE_REG__8_no(); LOAD_A(8, op2);         FLG(Z__); doBinopRR(rl78, 8, vmi_OR , rg1, tmp);                          PST(); }    // OR      A, !addr16
static RL78_DISPATCH_FN(rl78Morph_1_71_3rdmap   ) { PRE();                                                                                                                                                                 PST(); }    // 3rdmap
static RL78_DISPATCH_FN(rl78Morph_1_7X_MOV      ) { PRE();            BIT3(op1);            op2=R_A  ;  PRE_REG__8__8();                         FLG(___); doMoveRR(rl78, 8, rg1, rg2);                                    PST(); }    // MOV     ?, A
static RL78_DISPATCH_FN(rl78Morph_1_78_MOVW     ) { PRE(); IMM2(dis); op1=R_BC ;            op2=R_AX ;  PRE_REG_16_16();                         FLG(___); doStoreRRO(rl78, 16, dis, rg1, rg2);                            PST(); }    // MOVW    word[BC], AX
static RL78_DISPATCH_FN(rl78Morph_1_79_MOVW     ) { PRE();            op1=R_AX ; IMM2(dis); op2=R_BC ;  PRE_REG_16_16(); LOAD_R(16, dis, rg2);   FLG(___); doMoveRR(rl78, 16, rg1, tmp);           WRIT_16(op1);        PST(); }    // MOVW    AX, word[BC]
static RL78_DISPATCH_FN(rl78Morph_1_7A_XOR      ) { PRE();            SADDR(op1);           IMM1(op2);  PRE_REG_no_no(); LOAD_A(8, op1);         FLG(Z__); doBinopRC(rl78, 8, vmi_XOR, tmp, op2);  STOR_A(8, op1);        PST(); }    // XOR     saddr, #byte
static RL78_DISPATCH_FN(rl78Morph_1_7B_XOR      ) { PRE();            op1=R_A  ;            SADDR(op2); PRE_REG__8_no(); LOAD_A(8, op2);         FLG(Z__); doBinopRR(rl78, 8, vmi_XOR, rg1, tmp);                          PST(); }    // XOR     A, saddr
static RL78_DISPATCH_FN(rl78Morph_1_7C_XOR      ) { PRE();            op1=R_A  ;            IMM1(op2);  PRE_REG__8_no();                         FLG(Z__); doBinopRC(rl78, 8, vmi_XOR, rg1, op2);                          PST(); }    // XOR     A, #byte
static RL78_DISPATCH_FN(rl78Morph_1_7D_XOR      ) { PRE();            op1=R_A  ;            op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8,   0, rg2);    FLG(Z__); doBinopRR(rl78, 8, vmi_XOR, rg1, tmp);                          PST(); }    // XOR     A, [HL]
static RL78_DISPATCH_FN(rl78Morph_1_7E_XOR      ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8, dis, rg2);    FLG(Z__); doBinopRR(rl78, 8, vmi_XOR, rg1, tmp);                          PST(); }    // XOR     A, [HL+byte]
static RL78_DISPATCH_FN(rl78Morph_1_7F_XOR      ) { PRE();            op1=R_A  ;            IMM2(op2);  PRE_REG__8_no(); LOAD_A(8, op2);         FLG(Z__); doBinopRR(rl78, 8, vmi_XOR, rg1, tmp);                          PST(); }    // XOR     A, !addr16
static RL78_DISPATCH_FN(rl78Morph_1_8X_INC      ) { PRE();            BIT3(op1);                        PRE_REG__8_no();                         FLG(ZA_); doBinopRC(rl78, 8, vmi_ADD, rg1, 1);                            PST(); }    // INC     ?
