emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Morph.c
static RL78_DISPATCH_FN(rl78Morph_1_88_MOV      ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_SP ;  PRE_REG__8_16(); LOAD_R(8, dis, rg2);    FLG(___); doMoveRR(rl78, 8, rg1, tmp);                                    PST(); }    // MOV     A, [SP+byte]
static RL78_DISPATCH_FN(rl78Morph_1_89_MOV      ) { PRE();            op1=R_A  ;            op2=R_DE ;  PRE_REG__8_16(); LOAD_R(8,   0, rg2);    FLG(___); doMoveRR(rl78, 8, rg1, tmp);                                    PST(); }    // MOV     A, [DE]
static RL78_DISPATCH_FN(rl78Morph_1_8A_MOV      ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_DE ;  PRE_REG__8_16(); LOAD_R(8, dis, rg2);    FLG(___); doMoveRR(rl78, 8, rg1, tmp);                                    PST(); }    // MOV     A, [DE+byte]
static RL78_DISPATCH_FN(rl78Morph_1_8B_MOV      ) { PRE();            op1=R_A  ;            op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8,   0, rg2);    FLG(___); doMoveRR(rl78, 8, rg1, tmp);                                    PST(); }    // MOV     A, [HL]
static RL78_DISPATCH_FN(rl78Morph_1_8C_MOV      ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8, dis, rg2);    FLG(___); doMoveRR(rl78, 8, rg1, tmp);                                    PST(); }    // MOV     A, [HL+byte]
static RL78_DISPATCH_FN(rl78Morph_1_8D_MOV      ) { PRE();            op1=R_A  ;            SADDR(op2); PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doMoveRR(rl78, 8, rg1, tmp);                                    PST(); }    // MOV     A, saddr
static RL78_DISPATCH_FN(rl78Morph_1_8E_MOV      ) { PRE();            op1=R_A  ;            SFR(op2) ;  PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doMoveRR(rl78, 8, rg1, tmp);                                    PST(); }    // MOV     A, sfr
static RL78_DISPATCH_FN(rl78Morph_1_8F_MOV      ) { PRE();            op1=R_A  ;            IMM2(op2);  PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doMoveRR(rl78, 8, rg1, tmp);                                    PST(); }    // MOV     A, !addr16
static RL78_DISPATCH_FN(rl78Morph_1_9X_DEC      ) { PRE();            BIT3(op1);                        PRE_REG__8_no();                         FLG(ZA_); doBinopRC(rl78, 8, vmi_SUB, rg1, 1);                            PST(); }    // DEC     ?
static RL78_DISPATCH_FN(rl78Morph_1_98_MOV      ) { PRE(); IMM1(dis); op1=R_SP ;            op2=R_A  ;  PRE_REG_16__8();                         FLG(___); doStoreRRO(rl78, 8, dis, rg1, rg2);                             PST(); }    // MOV     [SP+byte], A
static RL78_DISPATCH_FN(rl78Morph_1_99_MOV      ) { PRE();            op1=R_DE ;            op2=R_A  ;  PRE_REG_16__8();                         FLG(___); doStoreRRO(rl78, 8,   0, rg1, rg2);                             PST(); }    // MOV     [DE], A
static RL78_DISPATCH_FN(rl78Morph_1_9A_MOV      ) { PRE(); IMM1(dis); op1=R_DE ;            op2=R_A  ;  PRE_REG_16__8();                         FLG(___); doStoreRRO(rl78, 8, dis, rg1, rg2);                             PST(); }    // MOV     [DE+byte], A
static RL78_DISPATCH_FN(rl78Morph_1_9B_MOV      ) { PRE();            op1=R_HL ;            op2=R_A  ;  PRE_REG_16__8();                         FLG(___); doStoreRRO(rl78, 8,   0, rg1, rg2);                             PST(); }    // MOV     [HL], A
static RL78_DISPATCH_FN(rl78Morph_1_9C_MOV      ) { PRE(); IMM1(dis); op1=R_HL ;            op2=R_A  ;  PRE_REG_16__8();                         FLG(___); doStoreRRO(rl78, 8, dis, rg1, rg2);                             PST(); }    // MOV     [HL+byte], A
static RL78_DISPATCH_FN(rl78Morph_1_9D_MOV      ) { PRE();            SADDR(op1);           op2=R_A  ;  PRE_REG_no__8();                         FLG(___); doStoreRRO(rl78, 8, op1, rg1, rg2);                             PST(); }    // MOV     saddr, A
static RL78_DISPATCH_FN(rl78Morph_1_9E_MOV      ) { PRE();            SFR(op1) ;            op2=R_A  ;  PRE_REG_no__8();                         FLG(___); doStoreRRO(rl78, 8, op1, rg1, rg2);                             PST(); }    // MOV     sfr, A
static RL78_DISPATCH_FN(rl78Morph_1_9F_MOV      ) { PRE();            IMM2(op1);            op2=R_A  ;  PRE_REG_no__8();                         FLG(___); doStoreRRO(rl78, 8, op1, rg1, rg2);                             PST(); }    // MOV     !addr16, A
static RL78_DISPATCH_FN(rl78Morph_1_A0_INC      ) { PRE();            IMM2(op1);                        PRE_REG_no_no(); LOAD_A(8, op1);         FLG(ZA_); doBinopRC(rl78, 8, vmi_ADD, tmp, 1);    STOR_A(8, op1);        PST(); }    // INC     !addr16
static RL78_DISPATCH_FN(rl78Morph_1_A2_INCW     ) { PRE();            IMM2(op1);                        PRE_REG_no_no(); LOAD_A(16, op1);        FLG(___); doBinopRC(rl78, 16, vmi_ADD, tmp, 1);   STOR_A(16, op1);        PST(); }    // INCW    !addr16
static RL78_DISPATCH_FN(rl78Morph_1_A4_INC      ) { PRE();            SADDR(op1);                       PRE_REG_no_no(); LOAD_A(8, op1);         FLG(ZA_); doBinopRC(rl78, 8, vmi_ADD, tmp, 1);    STOR_A(8, op1);        PST(); }    // INC     saddr
static RL78_DISPATCH_FN(rl78Morph_1_A6_INCW     ) { PRE();            SADDR(op1);                       PRE_REG_no_no(); LOAD_A(16, op1);        FLG(___); doBinopRC(rl78, 16, vmi_ADD, tmp, 1);   STOR_A(16, op1);        PST(); }    // INCW    saddrp
static RL78_DISPATCH_FN(rl78Morph_1_AX_INCW     ) { PRE();            BIT2(op1);                        PRE_REG_16_no();                         FLG(___); doBinopRC(rl78, 16, vmi_ADD, rg1, 1);   WRIT_16(op1);        PST(); }    // INCW    ??
static RL78_DISPATCH_FN(rl78Morph_1_A8_MOVW     ) { PRE();            op1=R_AX ; IMM1(dis); op2=R_SP ;  PRE_REG_16_16(); LOAD_R(16, dis, rg2);   FLG(___); doMoveRR(rl78, 16, rg1, tmp);           WRIT_16(op1);        PST(); }    // MOVW    AX, [SP+byte]
static RL78_DISPATCH_FN(rl78Morph_1_A9_MOVW     ) { PRE();            op1=R_AX ;            op2=R_DE ;  PRE_REG_16_16(); LOAD_R(16,   0, rg2);   FLG(___); doMoveRR(rl78, 16, rg1, tmp);           WRIT_16(op1);        PST(); }    // MOVW    AX, [DE]
static RL78_DISPATCH_FN(rl78Morph_1_AA_MOVW     ) { PRE();            op1=R_AX ; IMM1(dis); op2=R_DE ;  PRE_REG_16_16(); LOAD_R(16, dis, rg2);   FLG(___); doMoveRR(rl78, 16, rg1, tmp);           WRIT_16(op1);        PST(); }    // MOVW    AX, [DE+byte]
static RL78_DISPATCH_FN(rl78Morph_1_AB_MOVW     ) { PRE();            op1=R_AX ;            op2=R_HL ;  PRE_REG_16_16(); LOAD_R(16,   0, rg2);   FLG(___); doMoveRR(rl78, 16, rg1, tmp);           WRIT_16(op1);        PST(); }    // MOVW    AX, [HL]
static RL78_DISPATCH_FN(rl78Morph_1_AC_MOVW     ) { PRE();            op1=R_AX ; IMM1(dis); op2=R_HL ;  PRE_REG_16_16(); LOAD_R(16, dis, rg2);   FLG(___); doMoveRR(rl78, 16, rg1, tmp);           WRIT_16(op1);        PST(); }    // MOVW    AX, [HL+byte]
static RL78_DISPATCH_FN(rl78Morph_1_AD_MOVW     ) { PRE();            op1=R_AX ;            SADDR(op2); PRE_REG_16_no(); LOAD_A(16, op2);        FLG(___); doMoveRR(rl78, 16, rg1, tmp);           WRIT_16(op1);        PST(); }    // MOVW    AX, saddrp
static RL78_DISPATCH_FN(rl78Morph_1_AE_MOVW     ) { PRE();            op1=R_AX ;            SFR(op2) ;  PRE_REG_16_no(); LOAD_A(16, op2);        FLG(___); doMoveRR(rl78, 16, rg1, tmp);           WRIT_16(op1);        PST(); }    // MOVW    AX, sfrp
static RL78_DISPATCH_FN(rl78Morph_1_AF_MOVW     ) { PRE();            op1=R_AX ;            IMM2(op2);  PRE_REG_16_no(); LOAD_A(16, op2);        FLG(___); doMoveRR(rl78, 16, rg1, tmp);           WRIT_16(op1);        PST(); }    // MOVW    AX, !addr16
static RL78_DISPATCH_FN(rl78Morph_1_B0_DEC      ) { PRE();            IMM2(op1);                        PRE_REG_no_no(); LOAD_A(8, op1);         FLG(ZA_); doBinopRC(rl78, 8, vmi_SUB, tmp, 1);    STOR_A(8, op1);        PST(); }    // DEC     !addr16
static RL78_DISPATCH_FN(rl78Morph_1_B2_DECW     ) { PRE();            IMM2(op1);                        PRE_REG_no_no(); LOAD_A(16, op1);        FLG(___); doBinopRC(rl78, 16, vmi_SUB, tmp, 1);   STOR_A(16, op1);        PST(); }    // DECW    !addr16
static RL78_DISPATCH_FN(rl78Morph_1_B4_DEC      ) { PRE();            SADDR(op1);                       PRE_REG_no_no(); LOAD_A(8, op1);         FLG(ZA_); doBinopRC(rl78, 8, vmi_SUB, tmp, 1);    STOR_A(8, op1);        PST(); }    // DEC     saddr
static RL78_DISPATCH_FN(rl78Morph_1_B6_DECW     ) { PRE();            SADDR(op1);                       PRE_REG_no_no(); LOAD_A(16, op1);        FLG(___); doBinopRC(rl78, 16, vmi_SUB, tmp, 1);   STOR_A(16, op1);        PST(); }    // DECW    saddrp
static RL78_DISPATCH_FN(rl78Morph_1_BX_DECW     ) { PRE();            BIT2(op1);                        PRE_REG_16_no();                         FLG(___); doBinopRC(rl78, 16, vmi_SUB, rg1, 1);   WRIT_16(op1);        PST(); }    // DECW    ??
static RL78_DISPATCH_FN(rl78Morph_1_B8_MOVW     ) { PRE(); IMM1(dis); op1=R_SP ;            op2=R_AX ;  PRE_REG_16_16();                         FLG(___); doStoreRRO(rl78, 16, dis, rg1, rg2);                            PST(); }    // MOVW    [SP+byte], AX
static RL78_DISPATCH_FN(rl78Morph_1_B9_MOVW     ) { PRE();            op1=R_DE ;            op2=R_AX ;  PRE_REG_16_16();                         FLG(___); doStoreRRO(rl78, 16,   0, rg1, rg2);                            PST(); }    // MOVW    [DE], AX
static RL78_DISPATCH_FN(rl78Morph_1_BA_MOVW     ) { PRE(); IMM1(dis); op1=R_DE ;            op2=R_AX ;  PRE_REG_16_16();                         FLG(___); doStoreRRO(rl78, 16, dis, rg1, rg2);                            PST(); }    // MOVW    [DE+byte], AX
static RL78_DISPATCH_FN(rl78Morph_1_BB_MOVW     ) { PRE();            op1=R_HL ;            op2=R_AX ;  PRE_REG_16_16();                         FLG(___); doStoreRRO(rl78, 16,   0, rg1, rg2);                            PST(); }    // MOVW    [HL], AX
static RL78_DISPATCH_FN(rl78Morph_1_BC_MOVW     ) { PRE(); IMM1(dis); op1=R_HL ;            op2=R_AX ;  PRE_REG_16_16();                         FLG(___); doStoreRRO(rl78, 16, dis, rg1, rg2);                            PST(); }    // MOVW    [HL+byte], AX
static RL78_DISPATCH_FN(rl78Morph_1_BD_MOVW     ) { PRE();            SADDR(op1);           op2=R_AX ;  PRE_REG_no_16();                         FLG(___); doStoreRRO(rl78, 16, op1, rg1, rg2);                            PST(); }    // MOVW    saddrp, AX
static RL78_DISPATCH_FN(rl78Morph_1_BE_MOVW     ) { PRE();            SFR(op1) ;            op2=R_AX ;  PRE_REG_no_16();                         FLG(___); doStoreRRO(rl78, 16, op1, rg1, rg2);                            PST(); }    // MOVW    sfrp, AX
static RL78_DISPATCH_FN(rl78Morph_1_BF_MOVW     ) { PRE();            IMM2(op1);            op2=R_AX ;  PRE_REG_no_16();                         FLG(___); doStoreRRO(rl78, 16, op1, rg1, rg2);                            PST(); }    // MOVW    !addr16, AX
static RL78_DISPATCH_FN(rl78Morph_1_CX_POP      ) { PRE();            BIT2(op1);                        PRE_REG_16_no();                         FLG(___); doPopReg(rl78, 16, rg1);                WRIT_16(op1);        PST(); }    // POP     ??
static RL78_DISPATCH_FN(rl78Morph_1_CY_PUSH     ) { PRE();            BIT2(op1);                        PRE_REG_16_no();                         FLG(___); doPushReg(rl78, 16, rg1);                                     PST(); }    // PUSH    ??
static RL78_DISPATCH_FN(rl78Morph_1_C8_MOV      ) { PRE(); IMM1(dis); op1=R_SP ;            IMM1(op2);  PRE_REG_16_no();                         FLG(___); doStoreRCO(rl78, 8, dis, rg1, op2);                             PST(); }    // MOV     [SP+byte], #byte
static RL78_DISPATCH_FN(rl78Morph_1_C9_MOVW     ) { PRE();            SADDR(op1);           IMM2(op2);  PRE_REG_no_no();                         FLG(___); doStoreRCO(rl78, 16, op1, rg1, op2);                            PST(); }    // MOVW    saddrp, #word
static RL78_DISPATCH_FN(rl78Morph_1_CA_MOV      ) { PRE(); IMM1(dis); op1=R_DE ;            IMM1(op2);  PRE_REG_16_no();                         FLG(___); doStoreRCO(rl78, 8, dis, rg1, op2);                             PST(); }    // MOV     [DE+byte], #byte
static RL78_DISPATCH_FN(rl78Morph_1_CB_MOVW     ) { PRE();            SFR(op1) ;            IMM2(op2);  PRE_REG_no_no();                         FLG(___); doStoreRCO(rl78, 16, op1, rg1, op2);                            PST(); }    // MOVW    sfrp, #word
static RL78_DISPATCH_FN(rl78Morph_1_CC_MOV      ) { PRE(); IMM1(dis); op1=R_HL ;            IMM1(op2);  PRE_REG_16_no();                         FLG(___); doStoreRCO(rl78, 8, dis, rg1, op2);                             PST(); }    // MOV     [HL+byte], #byte
static RL78_DISPATCH_FN(rl78Morph_1_CD_MOV      ) { PRE();            SADDR(op1);           IMM1(op2);  PRE_REG_no_no();                         FLG(___); doStoreRCO(rl78, 8, op1, rg1, op2);                             PST(); }    // MOV     saddr, #byte
static RL78_DISPATCH_FN(rl78Morph_1_CE_MOV_SFR  ) { PRE();            SFR(op1) ;            IMM1(op2);  PRE_REG_no_no();                         FLG(___); doStoreRCO(rl78, 8, op1, rg1, op2);                             PST(); }    // MOV     sfr, #byte
static RL78_DISPATCH_FN(rl78Morph_1_CE_MOV_PSW  ) { PRE();            op1=R_PSW;            IMM1(op2);  PRE_REG__8_no();                         FLG(___); doMoveRC(rl78, 8, rg1, op2); doSetPSW();                        PST(); }    // MOV     PSW, #byte
static RL78_DISPATCH_FN(rl78Morph_1_CE_MOV_CS   ) { PRE();            op1=R_CS ;            IMM1(op2);  PRE_REG__8_no();                         FLG(___); doMoveRC(rl78, 8, rg1, op2);                                    PST(); }    // MOV     CS, #byte
static RL78_DISPATCH_FN(rl78Morph_1_CE_MULHU    ) { PRE();            op1=R_AX ;            op2=R_BC ;  PRE_REG_16_16(); CHKVARI(S3, "MULHU");   FLG(___); doMulopRR(16, vmi_MUL , rg1, rg2); WRIT_16(op1);WRIT_16(op2);PST(); }    // MULHU                   // BCAX �� AX * BC
static RL78_DISPATCH_FN(rl78Morph_1_CE_MULH     ) { PRE();            op1=R_AX ;            op2=R_BC ;  PRE_REG_16_16(); CHKVARI(S3, "MULH");    FLG(___); doMulopRR(16, vmi_IMUL, rg1, rg2); WRIT_16(op1);WRIT_16(op2);PST(); }    // MULH                    // BCAX �� sext(AX) * sext(BC)
static RL78_DISPATCH_FN(rl78Morph_1_CE_DIVHU    ) { PRE();            op1=R_AX ;            op2=R_DE ;  PRE_REG_16_16(); CHKVARI(S3, "DIVHU");   FLG(___); doDivopRR(16, vmi_DIV , rg1, rg2); WRIT_16(op1);WRIT_16(op2);PST(); }    // DIVHU                   // AX(��), DE(�]��) �� AX / DE
static RL78_DISPATCH_FN(rl78Morph_1_CE_DIVWU    ) { PRE();            op1=R_BCAX;           op2=R_HLDE; PRE_REG_32_32(); CHKVARI(S3, "DIVWU");   FLG(___); doDivopRR(32, vmi_DIV , rg1, rg2); WRIT_32(op1);WRIT_32(op2);PST(); }    // DIVWU                   // BCAX(��), HLDE(�]��) �� BCAX / HLDE
static RL78_DISPATCH_FN(rl78Morph_1_CE_MACHU    ) { PRE();            op1=R_AX ;            op2=R_BC ;  PRE_REG_16_16(); CHKVARI(S3, "MACHU");   FLG(_AC); doMACH(vmi_MUL , rg1, rg2);                                     PST(); }    // MACHU                   // MACR �� MACR + AX * BC
static RL78_DISPATCH_FN(rl78Morph_1_CE_MACH     ) { PRE();            op1=R_AX ;            op2=R_BC ;  PRE_REG_16_16(); CHKVARI(S3, "MACH");    FLG(_AC); doMACH(vmi_IMUL, rg1, rg2);                                     PST(); }    // MACH                    // MACR �� MACR + sext(AX) * sext(BC)    /* ��Z���ʂ̃e���|�����̈����ƁA�t���O�̍X�V���ʓ| */
static RL78_DISPATCH_FN(rl78Morph_1_CF_MOV      ) { PRE();            IMM2(op1);            IMM1(op2);  PRE_REG_no_no();                         FLG(___); doStoreRCO(rl78, 8, op1, rg1, op2);                             PST(); }    // MOV     !addr16, #byte
static RL78_DISPATCH_FN(rl78Morph_1_DX_CMP0     ) { PRE();            BIT3(op1);                        PRE_REG__8_no();                         FLG(ZAC); doCompareRC(rl78, 8, rg1, 0); /* set 0 to AC and CY */        PST(); }    // CMP0    ?
static RL78_DISPATCH_FN(rl78Morph_1_D4_CMP0     ) { PRE();            SADDR(op1);                       PRE_REG_no_no(); LOAD_A(8, op1);         FLG(ZAC); doCompareRC(rl78, 8, tmp, 0); /* set 0 to AC and CY */        PST(); }    // CMP0    saddr
static RL78_DISPATCH_FN(rl78Morph_1_D5_CMP0     ) { PRE();            IMM2(op1);                        PRE_REG_no_no(); LOAD_A(8, op1);         FLG(ZAC); doCompareRC(rl78, 8, tmp, 0); /* set 0 to AC and CY */        PST(); }    // CMP0    !addr16
static RL78_DISPATCH_FN(rl78Morph_1_D6_MULU     ) { PRE();            op1=R_A  ;            op2=R_X  ;  PRE_REG__8__8();                          FLG(___); doMulopRRR(rl78, 8, vmi_MUL, rg2, rg1, rg2); WRIT_16(R_AX);    PST(); }    // MULU    X
static RL78_DISPATCH_FN(rl78Morph_1_D7_RET      ) { PRE();                                              PRE_REG_no_no();                         FLG(___); doPopPC(rl78); doJumpReg(tmp, vmi_JH_RETURN);                PST(); }    // RET
static RL78_DISPATCH_FN(rl78Morph_1_D8_MOV      ) { PRE();            op1=R_X  ;            SADDR(op2); PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doMoveRR(rl78, 8, rg1, tmp);                                    PST(); }    // MOV     X, saddr
static RL78_DISPATCH_FN(rl78Morph_1_D9_MOV      ) { PRE();            op1=R_X  ;            IMM2(op2);  PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doMoveRR(rl78, 8, rg1, tmp);                                    PST(); }    // MOV     X, !addr16
static RL78_DISPATCH_FN(rl78Morph_1_DC_BC       ) { PRE();            IMM1(op1);                        PRE_REG_no_no();                         FLG(___); doCondJumpRel(rl78, thisPC, op1, en_Cond_C);                    PST(); }    // BC      $addr20
static RL78_DISPATCH_FN(rl78Morph_1_DD_BZ       ) { PRE();            IMM1(op1);                        PRE_REG_no_no();                         FLG(___); doCondJumpRel(rl78, thisPC, op1, en_Cond_Z);                    PST(); }    // BZ      $addr20
static RL78_DISPATCH_FN(rl78Morph_1_DE_BNC      ) { PRE();            IMM1(op1);                        PRE_REG_no_no();                         FLG(___); doCondJumpRel(rl78, thisPC, op1, en_Cond_NC);                PST(); }    // BNC     $addr20
static RL78_DISPATCH_FN(rl78Morph_1_DF_BNZ      ) { PRE();            IMM1(op1);                        PRE_REG_no_no();                         FLG(___); doCondJumpRel(rl78, thisPC, op1, en_Cond_NZ);                PST(); }    // BNZ     $addr20
static RL78_DISPATCH_FN(rl78Morph_1_EX_ONEB     ) { PRE();            BIT3(op1);                        PRE_REG__8_no();                         FLG(___); doMoveRC(rl78, 8, rg1, 1);                                      PST(); }    // ONEB    ?
static RL78_DISPATCH_FN(rl78Morph_1_E4_ONEB     ) { PRE();            SADDR(op1);                       PRE_REG_no_no();                         FLG(___); doStoreRCO(rl78, 8, op1, rg1, 1);                               PST(); }    // ONEB    saddr
static RL78_DISPATCH_FN(rl78Morph_1_E5_ONEB     ) { PRE();            IMM2(op1);                        PRE_REG_no_no();                         FLG(___); doStoreRCO(rl78, 8, op1, rg1, 1);                               PST(); }    // ONEB    !addr16
static RL78_DISPATCH_FN(rl78Morph_1_E6_ONEW     ) { PRE();            op1=R_AX ;                        PRE_REG_16_no();                         FLG(___); doMoveRC(rl78, 16, rg1, 1);             WRIT_16(op1);        PST(); }    // ONEW    AX
static RL78_DISPATCH_FN(rl78Morph_1_E7_ONEW     ) { PRE();            op1=R_BC ;                        PRE_REG_16_no();                         FLG(___); doMoveRC(rl78, 16, rg1, 1);             WRIT_16(op1);        PST(); }    // ONEW    BC
static RL78_DISPATCH_FN(rl78Morph_1_E8_MOV      ) { PRE();            op1=R_B  ;            SADDR(op2); PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doMoveRR(rl78, 8, rg1, tmp);                                    PST(); }    // MOV     B, saddr
static RL78_DISPATCH_FN(rl78Morph_1_E9_MOV      ) { PRE();            op1=R_B  ;            IMM2(op2);  PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doMoveRR(rl78, 8, rg1, tmp);                                    PST(); }    // MOV     B, !addr16
static RL78_DISPATCH_FN(rl78Morph_1_EC_BR       ) { PRE();            IMM3(op1);                        PRE_REG_no_no();                         FLG(___); doJumpDir(op1, vmi_JH_NONE);                                    PST(); }    // BR      !!addr20
static RL78_DISPATCH_FN(rl78Morph_1_ED_BR       ) { PRE();            IMM2(op1);                        PRE_REG_no_no();                         FLG(___); doJumpDir(op1, vmi_JH_NONE);                                    PST(); }    // BR      !addr16
static RL78_DISPATCH_FN(rl78Morph_1_EE_BR       ) { PRE();            IMM2(op1);                        PRE_REG_no_no();                         FLG(___); DOJUMPREL(16, op1, vmi_JH_NONE);                                PST(); }    // BR      $!addr20        // �P�U�r�b�g����
static RL78_DISPATCH_FN(rl78Morph_1_EF_BR       ) { PRE();            IMM1(op1);                        PRE_REG_no_no();                         FLG(___); DOJUMPREL(8, op1, vmi_JH_NONE);                                 PST(); }    // BR      $addr20        // �W�r�b�g����
static RL78_DISPATCH_FN(rl78Morph_1_FX_CLRB     ) { PRE();            BIT3(op1);                        PRE_REG__8_no();                         FLG(___); doMoveRC(rl78, 8, rg1, 0);                                      PST(); }    // CLRB    ?
static RL78_DISPATCH_FN(rl78Morph_1_F4_CLRB     ) { PRE();            SADDR(op1);                       PRE_REG_no_no();                         FLG(___); doStoreRCO(rl78, 8, op1, rg1, 0);                               PST(); }    // CLRB    saddr
static RL78_DISPATCH_FN(rl78Morph_1_F5_CLRB     ) { PRE();            IMM2(op1);                        PRE_REG_no_no();                         FLG(___); doStoreRCO(rl78, 8, op1, rg1, 0);                               PST(); }    // CLRB    !addr16
static RL78_DISPATCH_FN(rl78Morph_1_F6_CLRW     ) { PRE();            op1=R_AX ;                        PRE_REG_16_no();                         FLG(___); doMoveRC(rl78, 16, rg1, 0);             WRIT_16(op1);        PST(); }    // CLRW    AX
static RL78_DISPATCH_FN(rl78Morph_1_F7_CLRW     ) { PRE();            op1=R_BC ;                        PRE_REG_16_no();                         FLG(___); doMoveRC(rl78, 16, rg1, 0);             WRIT_16(op1);        PST(); }    // CLRW    BC
static RL78_DISPATCH_FN(rl78Morph_1_F8_MOV      ) { PRE();            op1=R_C  ;            SADDR(op2); PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doMoveRR(rl78, 8, rg1, tmp);                                    PST(); }    // MOV     C, saddr
static RL78_DISPATCH_FN(rl78Morph_1_F9_MOV      ) { PRE();            op1=R_C  ;            IMM2(op2);  PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doMoveRR(rl78, 8, rg1, tmp);                                    PST(); }    // MOV     C, !addr16
static RL78_DISPATCH_FN(rl78Morph_1_FC_CALL     ) { PRE();            IMM3(op1);                        PRE_REG_no_no();                         FLG(___); doPushPC(rl78, thisPC + 4); doCallDir(op1, thisPC + 4);        PST(); }    // CALL    !!addr20
static RL78_DISPATCH_FN(rl78Morph_1_FD_CALL     ) { PRE();            IMM2(op1);                        PRE_REG_no_no();                         FLG(___); doPushPC(rl78, thisPC + 3); doCallDir(op1, thisPC + 3);        PST(); }    // CALL    !addr16
static RL78_DISPATCH_FN(rl78Morph_1_FE_CALL     ) { PRE();            IMM2(op1);                        PRE_REG_no_no();                         FLG(___); doPushPC(rl78, thisPC + 3); DOCALLREL(16, op1, thisPC + 3);    PST(); }    // CALL    $!addr20        // �P�U�r�b�g����
static RL78_DISPATCH_FN(rl78Morph_1_XA_MOVW     ) { PRE();            BIT(op1,4,2);         SADDR(op2); PRE_REG_16_no(); LOAD_A(16, op2);        FLG(___); doMoveRR(rl78, 16, rg1, tmp);           WRIT_16(op1);        PST(); }    // MOVW    ??, saddrp
