emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Morph.c
static RL78_DISPATCH_FN(rl78Morph_1_XB_MOVW     ) { PRE();            BIT(op1,4,2);         IMM2(op2);  PRE_REG_16_no(); LOAD_A(16, op2);        FLG(___); doMoveRR(rl78, 16, rg1, tmp);           WRIT_16(op1);        PST(); }    // MOVW    ??, !addr16

static RL78_DISPATCH_FN(rl78Morph_2_0X_ADD      ) { PRE();            BIT3(op1);            op2=R_A  ;  PRE_REG__8__8();                         FLG(ZAC); doBinopRR(rl78, 8, vmi_ADD, rg1, rg2);                          PST(); }    // ADD     ?, A
static RL78_DISPATCH_FN(rl78Morph_2_09_ADDW     ) { PRE();            op1=R_AX ; IMM1(dis); op2=R_HL ;  PRE_REG_16_16(); LOAD_R(16, dis, rg2);   FLG(ZAC); doBinopRR(rl78, 16, vmi_ADD, rg1, tmp); WRIT_16(op1);        PST(); }    // ADDW    AX, [HL+byte]
static RL78_DISPATCH_FN(rl78Morph_2_0Y_ADD      ) { PRE();            op1=R_A  ;            BIT3(op2);  PRE_REG__8__8();                         FLG(ZAC); doBinopRR(rl78, 8, vmi_ADD, rg1, rg2);                          PST(); }    // ADD     A, ?
static RL78_DISPATCH_FN(rl78Morph_2_1X_ADDC     ) { PRE();            BIT3(op1);            op2=R_A  ;  PRE_REG__8__8();                         FLG(ZAC); doBinopRR(rl78, 8, vmi_ADC, rg1, rg2);                          PST(); }    // ADDC    ?, A
static RL78_DISPATCH_FN(rl78Morph_2_1Y_ADDC     ) { PRE();            op1=R_A  ;            BIT3(op2);  PRE_REG__8__8();                         FLG(ZAC); doBinopRR(rl78, 8, vmi_ADC, rg1, rg2);                          PST(); }    // ADDC    A, ?
static RL78_DISPATCH_FN(rl78Morph_2_2X_SUB      ) { PRE();            BIT3(op1);            op2=R_A  ;  PRE_REG__8__8();                         FLG(ZAC); doBinopRR(rl78, 8, vmi_SUB, rg1, rg2);                          PST(); }    // SUB     ?, A
static RL78_DISPATCH_FN(rl78Morph_2_29_SUBW     ) { PRE();            op1=R_AX ; IMM1(dis); op2=R_HL ;  PRE_REG_16_16(); LOAD_R(16, dis, rg2);   FLG(ZAC); doBinopRR(rl78, 16, vmi_SUB, rg1, tmp); WRIT_16(op1);        PST(); }    // SUBW    AX, [HL+byte]
static RL78_DISPATCH_FN(rl78Morph_2_2Y_SUB      ) { PRE();            op1=R_A  ;            BIT3(op2);  PRE_REG__8__8();                         FLG(ZAC); doBinopRR(rl78, 8, vmi_SUB, rg1, rg2);                          PST(); }    // SUB     A, ?
static RL78_DISPATCH_FN(rl78Morph_2_3X_SUBC     ) { PRE();            BIT3(op1);            op2=R_A  ;  PRE_REG__8__8();                         FLG(ZAC); doBinopRR(rl78, 8, vmi_SBB, rg1, rg2);                          PST(); }    // SUBC    ?, A
static RL78_DISPATCH_FN(rl78Morph_2_3Y_SUBC     ) { PRE();            op1=R_A  ;            BIT3(op2);  PRE_REG__8__8();                         FLG(ZAC); doBinopRR(rl78, 8, vmi_SBB, rg1, rg2);                          PST(); }    // SUBC    A, ?
static RL78_DISPATCH_FN(rl78Morph_2_4X_CMP      ) { PRE();            BIT3(op1);            op2=R_A  ;  PRE_REG__8__8();                         FLG(ZAC); doCompareRR(rl78, 8, rg1, rg2);                                 PST(); }    // CMP     ?, A
static RL78_DISPATCH_FN(rl78Morph_2_49_CMPW     ) { PRE();            op1=R_AX ; IMM1(dis); op2=R_HL ;  PRE_REG_16_16(); LOAD_R(16, dis, rg2);   FLG(ZAC); doCompareRR(rl78, 16, rg1, tmp);                                PST(); }    // CMPW    AX, [HL+byte]
static RL78_DISPATCH_FN(rl78Morph_2_4Y_CMP      ) { PRE();            op1=R_A  ;            BIT3(op2);  PRE_REG__8__8();                         FLG(ZAC); doCompareRR(rl78, 8, rg1, rg2);                                 PST(); }    // CMP     A, ?
static RL78_DISPATCH_FN(rl78Morph_2_5X_AND      ) { PRE();            BIT3(op1);            op2=R_A  ;  PRE_REG__8__8();                         FLG(Z__); doBinopRR(rl78, 8, vmi_AND, rg1, rg2);                          PST(); }    // AND     ?, A
static RL78_DISPATCH_FN(rl78Morph_2_59_INC      ) { PRE(); IMM1(dis); op1=R_HL ;                        PRE_REG_16_no(); LOAD_R(8, dis, rg1);    FLG(ZA_); doBinopRC(rl78, 8, vmi_ADD, tmp, 1);    STOR_R(8, dis, rg1);    PST(); }    // INC     [HL+byte]
static RL78_DISPATCH_FN(rl78Morph_2_5Y_AND      ) { PRE();            op1=R_A  ;            BIT3(op2);  PRE_REG__8__8();                         FLG(Z__); doBinopRR(rl78, 8, vmi_AND, rg1, rg2);                          PST(); }    // AND     A, ?
static RL78_DISPATCH_FN(rl78Morph_2_6X_OR       ) { PRE();            BIT3(op1);            op2=R_A  ;  PRE_REG__8__8();                         FLG(Z__); doBinopRR(rl78, 8, vmi_OR , rg1, rg2);                          PST(); }    // OR      ?, A
static RL78_DISPATCH_FN(rl78Morph_2_69_DEC      ) { PRE(); IMM1(dis); op1=R_HL ;                        PRE_REG_16_no(); LOAD_R(8, dis, rg1);    FLG(ZA_); doBinopRC(rl78, 8, vmi_SUB, tmp, 1);    STOR_R(8, dis, rg1);    PST(); }    // DEC     [HL+byte]
static RL78_DISPATCH_FN(rl78Morph_2_6Y_OR       ) { PRE();            op1=R_A  ;            BIT3(op2);  PRE_REG__8__8();                         FLG(Z__); doBinopRR(rl78, 8, vmi_OR, rg1, rg2);                           PST(); }    // OR      A, ?
static RL78_DISPATCH_FN(rl78Morph_2_7X_XOR      ) { PRE();            BIT3(op1);            op2=R_A  ;  PRE_REG__8__8();                         FLG(Z__); doBinopRR(rl78, 8, vmi_XOR, rg1, rg2);                          PST(); }    // XOR     ?, A
static RL78_DISPATCH_FN(rl78Morph_2_79_INCW     ) { PRE(); IMM1(dis); op1=R_HL ;                        PRE_REG_16_no(); LOAD_R(16, dis, rg1);   FLG(___); doBinopRC(rl78, 16, vmi_ADD, tmp, 1);   STOR_R(16, dis, rg1);PST(); }    // INCW    [HL+byte]
static RL78_DISPATCH_FN(rl78Morph_2_7Y_XOR      ) { PRE();            op1=R_A  ;            BIT3(op2);  PRE_REG__8__8();                         FLG(Z__); doBinopRR(rl78, 8, vmi_XOR, rg1, rg2);                          PST(); }    // XOR     A, ?
static RL78_DISPATCH_FN(rl78Morph_2_80_ADD      ) { PRE();            op1=R_A  ;            op2=R_B  ;  PRE_REG__8__8(); LOAD_W(8, R_HL, rg2);   FLG(ZAC); doBinopRR(rl78, 8, vmi_ADD, rg1, tmp);                          PST(); }    // ADD     A, [HL+B]
static RL78_DISPATCH_FN(rl78Morph_2_82_ADD      ) { PRE();            op1=R_A  ;            op2=R_C  ;  PRE_REG__8__8(); LOAD_W(8, R_HL, rg2);   FLG(ZAC); doBinopRR(rl78, 8, vmi_ADD, rg1, tmp);                          PST(); }    // ADD     A, [HL+C]
static RL78_DISPATCH_FN(rl78Morph_2_89_DECW     ) { PRE(); IMM1(dis); op1=R_HL ;                        PRE_REG_16_no(); LOAD_R(16, dis, rg1);   FLG(___); doBinopRC(rl78, 16, vmi_SUB, tmp, 1);   STOR_R(16, dis, rg1);PST(); }    // DECW    [HL+byte]
static RL78_DISPATCH_FN(rl78Morph_2_8X_XCH      ) { PRE();            op1=R_A  ;            BIT3(op2);  PRE_REG__8__8();                         FLG(___); doSwap(8, rg1, rg2);                                            PST(); }    // XCH     A, ?
static RL78_DISPATCH_FN(rl78Morph_2_90_ADDC     ) { PRE();            op1=R_A  ;            op2=R_B  ;  PRE_REG__8__8(); LOAD_W(8, R_HL, rg2);   FLG(ZAC); doBinopRR(rl78, 8, vmi_ADC, rg1, tmp);                          PST(); }    // ADDC    A, [HL+B]
static RL78_DISPATCH_FN(rl78Morph_2_92_ADDC     ) { PRE();            op1=R_A  ;            op2=R_C  ;  PRE_REG__8__8(); LOAD_W(8, R_HL, rg2);   FLG(ZAC); doBinopRR(rl78, 8, vmi_ADC, rg1, tmp);                          PST(); }    // ADDC    A, [HL+C]
static RL78_DISPATCH_FN(rl78Morph_2_A0_SUB      ) { PRE();            op1=R_A  ;            op2=R_B  ;  PRE_REG__8__8(); LOAD_W(8, R_HL, rg2);   FLG(ZAC); doBinopRR(rl78, 8, vmi_SUB, rg1, tmp);                          PST(); }    // SUB     A, [HL+B]
static RL78_DISPATCH_FN(rl78Morph_2_A2_SUB      ) { PRE();            op1=R_A  ;            op2=R_C  ;  PRE_REG__8__8(); LOAD_W(8, R_HL, rg2);   FLG(ZAC); doBinopRR(rl78, 8, vmi_SUB, rg1, tmp);                          PST(); }    // SUB     A, [HL+C]
static RL78_DISPATCH_FN(rl78Morph_2_A8_XCH      ) { PRE();            op1=R_A  ;            SADDR(op2); PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doSwap(8, rg1, tmp);                    STOR_A(8, op2);        PST(); }    // XCH     A, saddr
static RL78_DISPATCH_FN(rl78Morph_2_A9_XCH      ) { PRE();            op1=R_A  ;            op2=R_C  ;  PRE_REG__8__8(); LOAD_W(8, R_HL, rg2);   FLG(___); doSwap(8, rg1, tmp);                    STOR_W(8, R_HL, rg2);PST(); }    // XCH     A, [HL+C]
static RL78_DISPATCH_FN(rl78Morph_2_AA_XCH      ) { PRE();            op1=R_A  ;            IMM2(op2);  PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doSwap(8, rg1, tmp);                    STOR_A(8, op2);        PST(); }    // XCH     A, !addr16
static RL78_DISPATCH_FN(rl78Morph_2_AB_XCH      ) { PRE();            op1=R_A  ;            SFR(op2) ;  PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doSwap(8, rg1, tmp);                    STOR_A(8, op2);        PST(); }    // XCH     A, sfr
static RL78_DISPATCH_FN(rl78Morph_2_AC_XCH      ) { PRE();            op1=R_A  ;            op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8,   0, rg2);    FLG(___); doSwap(8, rg1, tmp);                    STOR_R(8,   0, rg2);    PST(); }    // XCH     A, [HL]
static RL78_DISPATCH_FN(rl78Morph_2_AD_XCH      ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8, dis, rg2);    FLG(___); doSwap(8, rg1, tmp);                    STOR_R(8, dis, rg2);    PST(); }    // XCH     A, [HL+byte]
static RL78_DISPATCH_FN(rl78Morph_2_AE_XCH      ) { PRE();            op1=R_A  ;            op2=R_DE ;  PRE_REG__8_16(); LOAD_R(8,   0, rg2);    FLG(___); doSwap(8, rg1, tmp);                    STOR_R(8,   0, rg2);    PST(); }    // XCH     A, [DE]
static RL78_DISPATCH_FN(rl78Morph_2_AF_XCH      ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_DE ;  PRE_REG__8_16(); LOAD_R(8, dis, rg2);    FLG(___); doSwap(8, rg1, tmp);                    STOR_R(8, dis, rg2);    PST(); }    // XCH     A, [DE+byte]
static RL78_DISPATCH_FN(rl78Morph_2_B0_SUBC     ) { PRE();            op1=R_A  ;            op2=R_B  ;  PRE_REG__8__8(); LOAD_W(8, R_HL, rg2);   FLG(ZAC); doBinopRR(rl78, 8, vmi_SBB, rg1, tmp);                          PST(); }    // SUBC    A, [HL+B]
static RL78_DISPATCH_FN(rl78Morph_2_B2_SUBC     ) { PRE();            op1=R_A  ;            op2=R_C  ;  PRE_REG__8__8(); LOAD_W(8, R_HL, rg2);   FLG(ZAC); doBinopRR(rl78, 8, vmi_SBB, rg1, tmp);                          PST(); }    // SUBC    A, [HL+C]
static RL78_DISPATCH_FN(rl78Morph_2_B8_MOV      ) { PRE();            op1=R_ES ;            SADDR(op2); PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doMoveRR(rl78, 8, rg1, tmp);                                    PST(); }    // MOV     ES, saddr
static RL78_DISPATCH_FN(rl78Morph_2_B9_XCH      ) { PRE();            op1=R_A  ;            op2=R_B  ;  PRE_REG__8__8(); LOAD_W(8, R_HL, rg2);   FLG(___); doSwap(8, rg1, tmp);                    STOR_W(8, R_HL, rg2);PST(); }    // XCH     A, [HL+B]
static RL78_DISPATCH_FN(rl78Morph_2_C0_CMP      ) { PRE();            op1=R_A  ;            op2=R_B  ;  PRE_REG__8__8(); LOAD_W(8, R_HL, rg2);   FLG(ZAC); doCompareRR(rl78, 8, rg1, tmp);                                 PST(); }    // CMP     A, [HL+B]
static RL78_DISPATCH_FN(rl78Morph_2_C2_CMP      ) { PRE();            op1=R_A  ;            op2=R_C  ;  PRE_REG__8__8(); LOAD_W(8, R_HL, rg2);   FLG(ZAC); doCompareRR(rl78, 8, rg1, tmp);                                 PST(); }    // CMP     A, [HL+C]
static RL78_DISPATCH_FN(rl78Morph_2_C3_BH       ) { PRE();            IMM1(op1);                        PRE_REG_no_no();                         FLG(___); doCondJumpRel(rl78, thisPC, op1, en_Cond_H);                    PST(); }    // BH      $addr20
static RL78_DISPATCH_FN(rl78Morph_2_C8_SKC      ) { PRE();                                              PRE_REG_no_no();                         FLG(___); badSkip(rl78);                                                PST(); }    // SKC
static RL78_DISPATCH_FN(rl78Morph_2_C9_MOV      ) { PRE();            op1=R_A  ;            op2=R_B  ;  PRE_REG__8__8(); LOAD_W(8, R_HL, rg2);   FLG(___); doMoveRR(rl78, 8, rg1, tmp);                                    PST(); }    // MOV     A, [HL+B]
static RL78_DISPATCH_FN(rl78Morph_2_CB_BR       ) { PRE();            op1=R_AX ;                        PRE_REG_16_no(); ADDR_CS(rg1);           FLG(___); doJumpReg(RL78_CS_ADDR, vmi_JH_NONE);                          PST(); }    // BR      AX
static RL78_DISPATCH_FN(rl78Morph_2_CC_BRK      ) { PRE();                                              PRE_REG_no_no();                         FLG(___); doGetPSW(tmp); doBRK(rl78, thisPC + 2, tmp);                  PST(); }    // BRK
static RL78_DISPATCH_FN(rl78Morph_2_CD_POP      ) { PRE();            op1=R_PSW;                        PRE_REG__8_no();                         FLG(___); doPopReg(rl78, 8, rg1); doSetPSW();                           PST(); }    // POP     PSW
static RL78_DISPATCH_FN(rl78Morph_2_CE_MOVS     ) { PRE(); IMM1(dis); op1=R_HL ;            op2=R_X  ;  PRE_REG_16__8();                         FLG(Z_C); doMOVS(rl78, dis, rg1, rg2);                                    PST(); }    // MOVS    [HL+byte], X
static RL78_DISPATCH_FN(rl78Morph_2_D0_AND      ) { PRE();            op1=R_A  ;            op2=R_B  ;  PRE_REG__8__8(); LOAD_W(8, R_HL, rg2);   FLG(Z__); doBinopRR(rl78, 8, vmi_AND, rg1, tmp);                          PST(); }    // AND     A, [HL+B]
static RL78_DISPATCH_FN(rl78Morph_2_D2_AND      ) { PRE();            op1=R_A  ;            op2=R_C  ;  PRE_REG__8__8(); LOAD_W(8, R_HL, rg2);   FLG(Z__); doBinopRR(rl78, 8, vmi_AND, rg1, tmp);                          PST(); }    // AND     A, [HL+C]
static RL78_DISPATCH_FN(rl78Morph_2_D3_BNH      ) { PRE();            IMM1(op1);                        PRE_REG_no_no();                         FLG(___); doCondJumpRel(rl78, thisPC, op1, en_Cond_NH);                PST(); }    // BNH     $addr20
static RL78_DISPATCH_FN(rl78Morph_2_D8_SKNC     ) { PRE();                                              PRE_REG_no_no();                         FLG(___); badSkip(rl78);                                               PST(); }    // SKNC
static RL78_DISPATCH_FN(rl78Morph_2_D9_MOV      ) { PRE();            op1=R_B  ;            op2=R_A  ;  PRE_REG__8__8();                         FLG(___); doMoveRR(rl78, 8, tmp, rg2);            STOR_W(8, R_HL, rg1);PST(); }    // MOV     [HL+B], A
static RL78_DISPATCH_FN(rl78Morph_2_DB_ROR      ) { PRE();            op1=R_A  ;                        PRE_REG__8_no();                         FLG(__C); doBinopRC(rl78, 8, vmi_ROR, rg1, 1);                            PST(); }    // ROR     A, 1
static RL78_DISPATCH_FN(rl78Morph_2_DC_ROLC     ) { PRE();            op1=R_A  ;                        PRE_REG__8_no();                         FLG(__C); doBinopRC(rl78, 8, vmi_RCL, rg1, 1);                            PST(); }    // ROLC    A, 1
static RL78_DISPATCH_FN(rl78Morph_2_DD_PUSH     ) { PRE();                                              PRE_REG_no_no();                         FLG(___); doGetPSW(tmp); doPushReg(rl78, 8, tmp);                       PST(); }    // PUSH    PSW
static RL78_DISPATCH_FN(rl78Morph_2_DE_CMPS     ) { PRE();            op1=R_X  ; IMM1(dis); op2=R_HL ;  PRE_REG__8_16(); LOAD_R(8, dis, rg2);    FLG(ZAC); doCMPS(rl78, rg1, tmp);                                         PST(); }    // CMPS    X, [HL+byte]
static RL78_DISPATCH_FN(rl78Morph_2_E0_OR       ) { PRE();            op1=R_A  ;            op2=R_B  ;  PRE_REG__8__8(); LOAD_W(8, R_HL, rg2);   FLG(Z__); doBinopRR(rl78, 8, vmi_OR, rg1, tmp);                           PST(); }    // OR      A, [HL+B]
static RL78_DISPATCH_FN(rl78Morph_2_E2_OR       ) { PRE();            op1=R_A  ;            op2=R_C  ;  PRE_REG__8__8(); LOAD_W(8, R_HL, rg2);   FLG(Z__); doBinopRR(rl78, 8, vmi_OR, rg1, tmp);                           PST(); }    // OR      A, [HL+C]
static RL78_DISPATCH_FN(rl78Morph_2_E3_SKH      ) { PRE();                                              PRE_REG_no_no();                         FLG(___); badSkip(rl78);                                                PST(); }    // SKH
static RL78_DISPATCH_FN(rl78Morph_2_E8_SKZ      ) { PRE();                                              PRE_REG_no_no();                         FLG(___); badSkip(rl78);                                                PST(); }    // SKZ
static RL78_DISPATCH_FN(rl78Morph_2_E9_MOV      ) { PRE();            op1=R_A  ;            op2=R_C  ;  PRE_REG__8__8(); LOAD_W(8, R_HL, rg2);   FLG(___); doMoveRR(rl78, 8, rg1, tmp);                                    PST(); }    // MOV     A, [HL+C]
static RL78_DISPATCH_FN(rl78Morph_2_EB_ROL      ) { PRE();            op1=R_A  ;                        PRE_REG__8_no();                         FLG(__C); doBinopRC(rl78, 8, vmi_ROL, rg1, 1);                            PST(); }    // ROL     A, 1
static RL78_DISPATCH_FN(rl78Morph_2_EC_RETB     ) { PRE();                                              PRE_REG_no_no();                         FLG(___); doRETB(rl78 /* ,tmp */ ); doJumpReg(tmp, vmi_JH_RETURNINT);    PST(); }    // RETB
static RL78_DISPATCH_FN(rl78Morph_2_ED_HALT     ) { PRE();                                              PRE_REG_no_no();                         FLG(___); doHALT(rl78);                                                   PST(); }    // HALT
static RL78_DISPATCH_FN(rl78Morph_2_F0_XOR      ) { PRE();            op1=R_A  ;            op2=R_B  ;  PRE_REG__8__8(); LOAD_W(8, R_HL, rg2);   FLG(Z__); doBinopRR(rl78, 8, vmi_XOR, rg1, tmp);                          PST(); }    // XOR     A, [HL+B]
static RL78_DISPATCH_FN(rl78Morph_2_F2_XOR      ) { PRE();            op1=R_A  ;            op2=R_C  ;  PRE_REG__8__8(); LOAD_W(8, R_HL, rg2);   FLG(Z__); doBinopRR(rl78, 8, vmi_XOR, rg1, tmp);                          PST(); }    // XOR     A, [HL+C]
static RL78_DISPATCH_FN(rl78Morph_2_F3_SKNH     ) { PRE();                                              PRE_REG_no_no();                         FLG(___); badSkip(rl78);                                               PST(); }    // SKNH
static RL78_DISPATCH_FN(rl78Morph_2_F8_SKNZ     ) { PRE();                                              PRE_REG_no_no();                         FLG(___); badSkip(rl78);                                               PST(); }    // SKNZ
static RL78_DISPATCH_FN(rl78Morph_2_F9_MOV      ) { PRE();            op1=R_C  ;            op2=R_A  ;  PRE_REG__8__8();                         FLG(___); doMoveRR(rl78, 8, tmp, rg2);            STOR_W(8, R_HL, rg1);PST(); }    // MOV     [HL+C], A
static RL78_DISPATCH_FN(rl78Morph_2_FB_RORC     ) { PRE();            op1=R_A  ;                        PRE_REG__8_no();                         FLG(__C); doBinopRC(rl78, 8, vmi_RCR, rg1, 1);                            PST(); }    // RORC    A, 1
static RL78_DISPATCH_FN(rl78Morph_2_FC_RETI     ) { PRE();                                              PRE_REG_no_no();                         FLG(___); doRETI(rl78 /* ,tmp */ ); doJumpReg(tmp, vmi_JH_RETURNINT);    PST(); }    // RETI
static RL78_DISPATCH_FN(rl78Morph_2_FD_STOP     ) { PRE();                                              PRE_REG_no_no();                         FLG(___); doSTOP(rl78);                                                   PST(); }    // STOP
static RL78_DISPATCH_FN(rl78Morph_2_XE_ROLWC    ) { PRE();            BIT(op1,4,1);                     PRE_REG_16_no();                         FLG(__C); doBinopRC(rl78, 16, vmi_RCL, rg1, 1);   WRIT_16(op1);        PST(); }    // ROLWC   ??, 1
static RL78_DISPATCH_FN(rl78Morph_2_XF_SEL      ) { PRE();            BIT(op1,4,2);                     PRE_REG_no_no(); CHKVARI(S2, "SEL");     FLG(___); doSEL(rl78, op1);                                             PST(); }    // SEL     RBn
static RL78_DISPATCH_FN(rl78Morph_2_XA_CALL     ) { PRE();            BIT(op1,4,2);                     PRE_REG_16_no(); ADDR_CS(rg1);           FLG(___); doPushPC(rl78, thisPC + 2); doCallReg(RL78_CS_ADDR, thisPC + 2);    PST(); }    // CALL    ??
static RL78_DISPATCH_FN(rl78Morph_2_XX_CALLT    ) { PRE();            BIT(op1,4,3); BIT(op2,0,2);       PRE_REG_no_no();                         FLG(___); doPushPC(rl78, thisPC + 2); doCALLT(op2, op1, thisPC + 2);    PST(); }    // CALLT   [00nnh]

