emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Morph.c
static RL78_DISPATCH_FN(rl78Morph_3_X0_SET1     ) { PRE(); IDX3(ix1); IMM2(op1);                        PRE_REG_no_no(); LOAD_A(8, op1);         FLG(___); doMOV1_R_IM(tmp, ix1, 1);               STOR_A(8, op1);        PST(); }    // SET1    !addr16.n
static RL78_DISPATCH_FN(rl78Morph_3_X1_MOV1     ) { PRE(); IDX3(ix1); SADDR(op1);           op2=R_CY ;  PRE_REG_no__8(); LOAD_A(8, op1);         FLG(___); doMOV1_R_CY(tmp, ix1, rg2);             STOR_A(8, op1);        PST(); }    // MOV1    saddr.n, CY
static RL78_DISPATCH_FN(rl78Morph_3_X2_SET1     ) { PRE(); IDX3(ix1); SADDR(op1);                       PRE_REG_no_no(); LOAD_A(8, op1);         FLG(___); doMOV1_R_IM(tmp, ix1, 1);               STOR_A(8, op1);        PST(); }    // SET1    saddr.n
static RL78_DISPATCH_FN(rl78Morph_3_X3_CLR1     ) { PRE(); IDX3(ix1); SADDR(op1);                       PRE_REG_no_no(); LOAD_A(8, op1);         FLG(___); doMOV1_R_IM(tmp, ix1, 0);               STOR_A(8, op1);        PST(); }    // CLR1    saddr.n
static RL78_DISPATCH_FN(rl78Morph_3_X4_MOV1     ) { PRE(); IDX3(ix1); op1=R_CY ; SADDR(op2);            PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doMOV1_CY_R(rg1, tmp, ix1);                                     PST(); }    // MOV1    CY, saddr.n
static RL78_DISPATCH_FN(rl78Morph_3_X5_AND1     ) { PRE(); IDX3(ix1); op1=R_CY ; SADDR(op2);            PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doBinop_CY_R(rg1, vmi_AND, tmp, ix1);                           PST(); }    // AND1    CY, saddr.n
static RL78_DISPATCH_FN(rl78Morph_3_X6_OR1      ) { PRE(); IDX3(ix1); op1=R_CY ; SADDR(op2);            PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doBinop_CY_R(rg1, vmi_OR , tmp, ix1);                           PST(); }    // OR1     CY, saddr.n
static RL78_DISPATCH_FN(rl78Morph_3_X7_XOR1     ) { PRE(); IDX3(ix1); op1=R_CY ; SADDR(op2);            PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doBinop_CY_R(rg1, vmi_XOR, tmp, ix1);                           PST(); }    // XOR1    CY, saddr.n
static RL78_DISPATCH_FN(rl78Morph_3_X8_CLR1     ) { PRE(); IDX3(ix1); IMM2(op1);                        PRE_REG_no_no(); LOAD_A(8, op1);         FLG(___); doMOV1_R_IM(tmp, ix1, 0);               STOR_A(8, op1);        PST(); }    // CLR1    !addr16.n
static RL78_DISPATCH_FN(rl78Morph_3_X9_MOV1     ) { PRE(); IDX3(ix1); SFR(op1) ;            op2=R_CY ;  PRE_REG_no__8(); LOAD_A(8, op1);         FLG(___); doMOV1_R_CY(tmp, ix1, rg2);             STOR_A(8, op1);        PST(); }    // MOV1    sfr.n, CY
static RL78_DISPATCH_FN(rl78Morph_3_XA_SET1     ) { PRE(); IDX3(ix1); SFR(op1) ;                        PRE_REG_no_no(); LOAD_A(8, op1);         FLG(___); doMOV1_R_IM(tmp, ix1, 1);               STOR_A(8, op1);        PST(); }    // SET1    sfr.n
static RL78_DISPATCH_FN(rl78Morph_3_XB_CLR1     ) { PRE(); IDX3(ix1); SFR(op1) ;                        PRE_REG_no_no(); LOAD_A(8, op1);         FLG(___); doMOV1_R_IM(tmp, ix1, 0);               STOR_A(8, op1);        PST(); }    // CLR1    sfr.n
static RL78_DISPATCH_FN(rl78Morph_3_XC_MOV1     ) { PRE(); IDX3(ix1); op1=R_CY ; SFR(op2) ;             PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doMOV1_CY_R(rg1, tmp, ix1);                                     PST(); }    // MOV1    CY, sfr.n
static RL78_DISPATCH_FN(rl78Morph_3_XD_AND1     ) { PRE(); IDX3(ix1); op1=R_CY ; SFR(op2) ;             PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doBinop_CY_R(rg1, vmi_AND, tmp, ix1);                           PST(); }    // AND1    CY, sfr.n
static RL78_DISPATCH_FN(rl78Morph_3_XE_OR1      ) { PRE(); IDX3(ix1); op1=R_CY ; SFR(op2) ;             PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doBinop_CY_R(rg1, vmi_OR , tmp, ix1);                           PST(); }    // OR1     CY, sfr.n
static RL78_DISPATCH_FN(rl78Morph_3_XF_XOR1     ) { PRE(); IDX3(ix1); op1=R_CY ; SFR(op2) ;             PRE_REG__8_no(); LOAD_A(8, op2);         FLG(___); doBinop_CY_R(rg1, vmi_XOR, tmp, ix1);                           PST(); }    // XOR1    CY, sfr.n
static RL78_DISPATCH_FN(rl78Morph_3_7A_EI       ) { PRE();                                              PRE_REG_no_no();                         FLG(___); doMoveRC(rl78, 8, RL78_IE, 1); doEI(rl78);                    PST(); }    // EI
static RL78_DISPATCH_FN(rl78Morph_3_7B_DI       ) { PRE();                                              PRE_REG_no_no();                         FLG(___); doMoveRC(rl78, 8, RL78_IE, 0);                                  PST(); }    // DI
static RL78_DISPATCH_FN(rl78Morph_3_80_SET1     ) { PRE();            op1=R_CY ;                        PRE_REG__8_no();                         FLG(___); doMoveRC(rl78, 8, rg1, 1);                                      PST(); }    // SET1    CY
static RL78_DISPATCH_FN(rl78Morph_3_88_CLR1     ) { PRE();            op1=R_CY ;                        PRE_REG__8_no();                         FLG(___); doMoveRC(rl78, 8, rg1, 0);                                      PST(); }    // CLR1    CY
static RL78_DISPATCH_FN(rl78Morph_3_C0_NOT1     ) { PRE();            op1=R_CY ;                        PRE_REG__8_no();                         FLG(___); doBinopRC(rl78, 8, vmi_XOR, rg1, 1);                            PST(); }    // NOT1    CY
static RL78_DISPATCH_FN(rl78Morph_3_Y1_MOV1     ) { PRE(); IDX3(ix1); op1=R_HL ;            op2=R_CY;   PRE_REG_16__8(); LOAD_R(8, 0, rg1);      FLG(___); doMOV1_R_CY(tmp, ix1, rg2);             STOR_R(8, 0, rg1);    PST(); }    // MOV1    [HL].n, CY
static RL78_DISPATCH_FN(rl78Morph_3_Y2_SET1     ) { PRE(); IDX3(ix1); op1=R_HL ;                        PRE_REG_16_no(); LOAD_R(8, 0, rg1);      FLG(___); doMOV1_R_IM(tmp, ix1, 1);               STOR_R(8, 0, rg1);    PST(); }    // SET1    [HL].n
static RL78_DISPATCH_FN(rl78Morph_3_Y3_CLR1     ) { PRE(); IDX3(ix1); op1=R_HL ;                        PRE_REG_16_no(); LOAD_R(8, 0, rg1);      FLG(___); doMOV1_R_IM(tmp, ix1, 0);               STOR_R(8, 0, rg1);    PST(); }    // CLR1    [HL].n
static RL78_DISPATCH_FN(rl78Morph_3_Y4_MOV1     ) { PRE(); IDX3(ix1); op1=R_CY ; op2=R_HL ;             PRE_REG__8_16(); LOAD_R(8, 0, rg2);      FLG(___); doMOV1_CY_R(rg1, tmp, ix1);                                     PST(); }    // MOV1    CY, [HL].n
static RL78_DISPATCH_FN(rl78Morph_3_Y5_AND1     ) { PRE(); IDX3(ix1); op1=R_CY ; op2=R_HL ;             PRE_REG__8_16(); LOAD_R(8, 0, rg2);      FLG(___); doBinop_CY_R(rg1, vmi_AND, tmp, ix1);                           PST(); }    // AND1    CY, [HL].n
static RL78_DISPATCH_FN(rl78Morph_3_Y6_OR1      ) { PRE(); IDX3(ix1); op1=R_CY ; op2=R_HL ;             PRE_REG__8_16(); LOAD_R(8, 0, rg2);      FLG(___); doBinop_CY_R(rg1, vmi_OR , tmp, ix1);                           PST(); }    // OR1     CY, [HL].n
static RL78_DISPATCH_FN(rl78Morph_3_Y7_XOR1     ) { PRE(); IDX3(ix1); op1=R_CY ; op2=R_HL ;             PRE_REG__8_16(); LOAD_R(8, 0, rg2);      FLG(___); doBinop_CY_R(rg1, vmi_XOR, tmp, ix1);                           PST(); }    // XOR1    CY, [HL].n
static RL78_DISPATCH_FN(rl78Morph_3_Y9_MOV1     ) { PRE(); IDX3(ix1); op1=R_A  ;            op2=R_CY;   PRE_REG__8__8();                         FLG(___); doMOV1_R_CY(rg1, ix1, rg2);                                     PST(); }    // MOV1    A.n, CY
static RL78_DISPATCH_FN(rl78Morph_3_YA_SET1     ) { PRE(); IDX3(ix1); op1=R_A  ;                        PRE_REG__8_no();                         FLG(___); doMOV1_R_IM(rg1, ix1, 1);                                       PST(); }    // SET1    A.n
static RL78_DISPATCH_FN(rl78Morph_3_YB_CLR1     ) { PRE(); IDX3(ix1); op1=R_A  ;                        PRE_REG__8_no();                         FLG(___); doMOV1_R_IM(rg1, ix1, 0);                                       PST(); }    // CLR1    A.n
static RL78_DISPATCH_FN(rl78Morph_3_YC_MOV1     ) { PRE(); IDX3(ix1); op1=R_CY ; op2=R_A  ;             PRE_REG__8__8();                         FLG(___); doMOV1_CY_R(rg1, rg2, ix1);                                     PST(); }    // MOV1    CY, A.n
static RL78_DISPATCH_FN(rl78Morph_3_YD_AND1     ) { PRE(); IDX3(ix1); op1=R_CY ; op2=R_A  ;             PRE_REG__8__8();                         FLG(___); doBinop_CY_R(rg1, vmi_AND, rg2, ix1);                           PST(); }    // AND1    CY, A.n
static RL78_DISPATCH_FN(rl78Morph_3_YE_OR1      ) { PRE(); IDX3(ix1); op1=R_CY ; op2=R_A  ;             PRE_REG__8__8();                         FLG(___); doBinop_CY_R(rg1, vmi_OR , rg2, ix1);                           PST(); }    // OR1     CY, A.n
static RL78_DISPATCH_FN(rl78Morph_3_YF_XOR1     ) { PRE(); IDX3(ix1); op1=R_CY ; op2=R_A  ;             PRE_REG__8__8();                         FLG(___); doBinop_CY_R(rg1, vmi_XOR, rg2, ix1);                           PST(); }    // XOR1    CY, A.n

static RL78_DISPATCH_FN(rl78Morph_4_X0_BTCLR    ) { PRE(); IDX3(ix1); SADDR(op1);IMM1(op2);             PRE_REG_no_no(); LOAD_A(8, op1);         FLG(___); doBitTest(en_Cond_TCLR, tmp, ix1);      STOR_A(8, op1);        doCondJumpRel(rl78, thisPC, op2, en_Cond_TCLR);    PST(); }    // BTCLR   saddr.n, $addr20
static RL78_DISPATCH_FN(rl78Morph_4_X1_BTCLR    ) { PRE(); IDX3(ix1); op1=R_A  ; IMM1(op2);             PRE_REG__8_no();                         FLG(___); doBitTest(en_Cond_TCLR, rg1, ix1);                              doCondJumpRel(rl78, thisPC, op2, en_Cond_TCLR);    PST(); }    // BTCLR   A.n, $addr20
static RL78_DISPATCH_FN(rl78Morph_4_X2_BT       ) { PRE(); IDX3(ix1); SADDR(op1);IMM1(op2);             PRE_REG_no_no(); LOAD_A(8, op1);         FLG(___); doBitTest(en_Cond_T   , tmp, ix1);                              doCondJumpRel(rl78, thisPC, op2, en_Cond_T   );    PST(); }    // BT      saddr.n, $addr20
static RL78_DISPATCH_FN(rl78Morph_4_X3_BT       ) { PRE(); IDX3(ix1); op1=R_A  ; IMM1(op2);             PRE_REG__8_no();                         FLG(___); doBitTest(en_Cond_T   , rg1, ix1);                              doCondJumpRel(rl78, thisPC, op2, en_Cond_T   );    PST(); }    // BT      A.n, $addr20
static RL78_DISPATCH_FN(rl78Morph_4_X4_BF       ) { PRE(); IDX3(ix1); SADDR(op1);IMM1(op2);             PRE_REG_no_no(); LOAD_A(8, op1);         FLG(___); doBitTest(en_Cond_F   , tmp, ix1);                              doCondJumpRel(rl78, thisPC, op2, en_Cond_F   );    PST(); }    // BF      saddr.n, $addr20
static RL78_DISPATCH_FN(rl78Morph_4_X5_BF       ) { PRE(); IDX3(ix1); op1=R_A  ; IMM1(op2);             PRE_REG__8_no();                         FLG(___); doBitTest(en_Cond_F   , rg1, ix1);                              doCondJumpRel(rl78, thisPC, op2, en_Cond_F   );    PST(); }    // BF      A.n, $addr20
static RL78_DISPATCH_FN(rl78Morph_4_X7_SHL      ) { PRE(); IDX3(ix1); op1=R_C  ;                        PRE_REG__8_no();                         FLG(__C); doBinopRC(rl78, 8, vmi_SHL, rg1, ix1);                          PST(); }    // SHL     C, n
static RL78_DISPATCH_FN(rl78Morph_4_X8_SHL      ) { PRE(); IDX3(ix1); op1=R_B  ;                        PRE_REG__8_no();                         FLG(__C); doBinopRC(rl78, 8, vmi_SHL, rg1, ix1);                          PST(); }    // SHL     B, n
static RL78_DISPATCH_FN(rl78Morph_4_X9_SHL      ) { PRE(); IDX3(ix1); op1=R_A  ;                        PRE_REG__8_no();                         FLG(__C); doBinopRC(rl78, 8, vmi_SHL, rg1, ix1);                          PST(); }    // SHL     A, n
static RL78_DISPATCH_FN(rl78Morph_4_XA_SHR      ) { PRE(); IDX3(ix1); op1=R_A  ;                        PRE_REG__8_no();                         FLG(__C); doBinopRC(rl78, 8, vmi_SHR, rg1, ix1);                          PST(); }    // SHR     A, n
static RL78_DISPATCH_FN(rl78Morph_4_XB_SAR      ) { PRE(); IDX3(ix1); op1=R_A  ;                        PRE_REG__8_no();                         FLG(__C); doBinopRC(rl78, 8, vmi_SAR, rg1, ix1);                          PST(); }    // SAR     A, n
static RL78_DISPATCH_FN(rl78Morph_4_Y0_BTCLR    ) { PRE(); IDX3(ix1); SFR(op1) ; IMM1(op2);             PRE_REG_no_no(); LOAD_A(8, op1);         FLG(___); doBitTest(en_Cond_TCLR, tmp, ix1);      STOR_A(8, op1);        doCondJumpRel(rl78, thisPC, op2, en_Cond_TCLR);    PST(); }    // BTCLR   sfr.n, $addr20
static RL78_DISPATCH_FN(rl78Morph_4_Y1_BTCLR    ) { PRE(); IDX3(ix1); op1=R_HL ; IMM1(op2);             PRE_REG_16_no(); LOAD_R(8, 0, rg1);      FLG(___); doBitTest(en_Cond_TCLR, tmp, ix1);      STOR_R(8, 0, rg1);    doCondJumpRel(rl78, thisPC, op2, en_Cond_TCLR);    PST(); }    // BTCLR   [HL].n, $addr20
static RL78_DISPATCH_FN(rl78Morph_4_Y2_BT       ) { PRE(); IDX3(ix1); SFR(op1) ; IMM1(op2);             PRE_REG_no_no(); LOAD_A(8, op1);         FLG(___); doBitTest(en_Cond_T   , tmp, ix1);                              doCondJumpRel(rl78, thisPC, op2, en_Cond_T   );    PST(); }    // BT      sfr.n, $addr20
static RL78_DISPATCH_FN(rl78Morph_4_Y3_BT       ) { PRE(); IDX3(ix1); op1=R_HL ; IMM1(op2);             PRE_REG_16_no(); LOAD_R(8, 0, rg1);      FLG(___); doBitTest(en_Cond_T   , tmp, ix1);                              doCondJumpRel(rl78, thisPC, op2, en_Cond_T   );    PST(); }    // BT      [HL].n, $addr20
static RL78_DISPATCH_FN(rl78Morph_4_Y4_BF       ) { PRE(); IDX3(ix1); SFR(op1) ; IMM1(op2);             PRE_REG_no_no(); LOAD_A(8, op1);         FLG(___); doBitTest(en_Cond_F   , tmp, ix1);                              doCondJumpRel(rl78, thisPC, op2, en_Cond_F   );    PST(); }    // BF      sfr.n, $addr20
static RL78_DISPATCH_FN(rl78Morph_4_Y5_BF       ) { PRE(); IDX3(ix1); op1=R_HL ; IMM1(op2);             PRE_REG_16_no(); LOAD_R(8, 0, rg1);      FLG(___); doBitTest(en_Cond_F   , tmp, ix1);                              doCondJumpRel(rl78, thisPC, op2, en_Cond_F   );    PST(); }    // BF      [HL].n, $addr20
static RL78_DISPATCH_FN(rl78Morph_4_XC_SHLW     ) { PRE(); IDX4(ix1); op1=R_BC ;                        PRE_REG_16_no();                         FLG(__C); doBinopRC(rl78, 16, vmi_SHL, rg1, ix1); WRIT_16(op1);        PST(); }    // SHLW    BC, nn
static RL78_DISPATCH_FN(rl78Morph_4_XD_SHLW     ) { PRE(); IDX4(ix1); op1=R_AX ;                        PRE_REG_16_no();                         FLG(__C); doBinopRC(rl78, 16, vmi_SHL, rg1, ix1); WRIT_16(op1);        PST(); }    // SHLW    AX, nn
static RL78_DISPATCH_FN(rl78Morph_4_XE_SHRW     ) { PRE(); IDX4(ix1); op1=R_AX ;                        PRE_REG_16_no();                         FLG(__C); doBinopRC(rl78, 16, vmi_SHR, rg1, ix1); WRIT_16(op1);        PST(); }    // SHRW    AX, nn
static RL78_DISPATCH_FN(rl78Morph_4_XF_SARW     ) { PRE(); IDX4(ix1); op1=R_AX ;                        PRE_REG_16_no();                         FLG(__C); doBinopRC(rl78, 16, vmi_SAR, rg1, ix1); WRIT_16(op1);        PST(); }    // SARW    AX, nn

