emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Morph.c
};

//
// Called for an undecoded instruction
//
static void undecoded(
    vmiProcessorP processor,
    Uns32         thisPC,
    Uns32         instr0,
    Uns32         instr1,
    Uns32         instr2,
    Uns32         instr3,
    Uns32         instr4
) {
    // report that undecoded instruction was encountered
    vmiPrintf(
        "CPU '%s' 0x%08x:0x%02x 0x%02x 0x%02x 0x%02x 0x%02x *** undecoded instruction: exiting ***\n",
        vmirtProcessorName(processor),
        thisPC,
        instr0, instr1, instr2, instr3, instr4
    );

    // exit the CPU
    vmirtExit(processor);
}

//
// Default morpher callback
//
static RL78_DISPATCH_FN(morphDefault) {

    // print message warning about the undecoded instruction
    vmimtArgProcessor();
    vmimtArgUns32((Uns32)thisPC);
    vmimtArgUns32(instr[0]);
    vmimtArgUns32(instr[1]);
    vmimtArgUns32(instr[2]);
    vmimtArgUns32(instr[3]);
    vmimtArgUns32(instr[4]);
    vmimtCall((vmiCallFn) undecoded);
}

//
// Create code for the RL78 instruction at the simulated address referenced
// by 'thisPC'.
//
// #define VMI_MORPH_FN(_NAME) void _NAME( 
//     vmiProcessorP processor,    
//     Addr          thisPC,       
//     Uns8          inDelaySlot,  
//     Bool          firstInBlock, 
//     Bool          emitTrace     
// )
VMI_MORPH_FN(rl78MorphInstruction) {
    rl78Decode((rl78P)processor, thisPC, &dispatchTable, morphDefault, 0);
}


//#define VMI_RD_WR_SNAP_FN(_NAME) Uns32 _NAME( 
//    vmiProcessorP processor,    
//    Addr          address,      
//    Uns32         bytes         
//)
VMI_RD_WR_SNAP_FN(rl78RdSnapCB) {
    return bytes;
}

VMI_RD_WR_SNAP_FN(rl78WrSnapCB) {
    return bytes;
}
